[
  {
    "slug": "gym-leg-press-0",
    "name": "Leg Press",
    "environment": "GYM",
    "primaryMuscle": "Cuádriceps, glúteos, isquiotibiales",
    "description": "La prensa de piernas es un ejercicio compuesto en máquina que permite desarrollar fuerza y masa muscular en las piernas con mayor control y menor estrés sobre la columna vertebral que el squat libre.\n\nEs ideal para principiantes que aún no dominan el patrón del squat, para personas con limitaciones en la espalda, o como ejercicio complementario en rutinas de pierna.\n\nLa máquina guía el movimiento y permite aislar las piernas sin exigir tanto al core, lo que facilita cargas pesadas de forma segura cuando se ejecuta correctamente.",
    "cues": "Coloca los pies a la anchura de hombros o ligeramente más anchos en la plataforma.\nMantén la espalda y la zona lumbar firmemente apoyadas en el respaldo en todo momento.\nBaja la plataforma de forma controlada hasta un ángulo de unos 90° en rodilla.\nExtiende empujando con los talones, sin bloquear las rodillas al final.\nControla la fase excéntrica (bajada) para maximizar el trabajo muscular.",
    "commonMistakes": "Separar la zona lumbar del respaldo (butt wink): riesgo de lesión en disco.\nRebotar en el punto más bajo: elimina tensión y puede dañar rodillas.\nBloquear las rodillas al extender: compresión articular innecesaria.\nColocar los pies demasiado altos: más implicación de glúteos e isquios, menos cuádriceps.\nColocar los pies demasiado bajos o muy juntos: estrés excesivo en rodillas.",
    "regressions": "Reduce el peso hasta dominar el patrón.\nAcorta el rango de movimiento si hay molestias.\nPrensa de piernas en máquina vertical (menor carga axial).",
    "progressions": "Pausa de 2-3 segundos en la parte inferior.\nPrensa a una pierna para mayor demanda de estabilidad.\nMayor rango (descender más) si la movilidad lo permite.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "prensa-de-piernas",
    "name": "Prensa de piernas (leg press)",
    "environment": "GYM",
    "primaryMuscle": "Cuádriceps, glúteos, isquiotibiales",
    "description": "Empuje de piernas en máquina para trabajar cuádriceps (principal) y también glúteos/isquios según postura y rango. Muy útil en MVP por ser estándar en gym y fácil de registrar.\n\nTécnica: Ajusta el asiento para que, abajo, tengas un rango cómodo sin que la cadera se despegue del respaldo. Pies a anchura cómoda en la plataforma; rodillas siguen la dirección de los pies. Baja controlado hasta donde mantengas espalda pegada al respaldo y control de rodillas (sin colapsar hacia dentro). Sube empujando la plataforma y sin bloquear las rodillas de forma agresiva. Repite con ritmo estable (sin rebotes).",
    "cues": "Espalda pegada al respaldo\nRodillas siguen a los pies\nBaja controlado sin que la cadera se despegue\nSube sin bloquear fuerte las rodillas\nSin rebote",
    "commonMistakes": "Bajar demasiado y que la cadera se levante: recorta rango (prioridad: control).\nBloquear rodillas arriba: deja una micro-flexión.\nRebotar para mover más peso: baja carga y controla.\nRodillas colapsan hacia dentro.",
    "regressions": "Menos carga + rango más corto (perfecto control)\nPausa 1s abajo sin rebote",
    "progressions": "Tempo: bajada 2–3s\nPausa 1s abajo manteniendo postura\nMás carga manteniendo el mismo control",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Leg-press-1-1024x670.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=K5n2vg3oZa4",
        "thumbnailUrl": "https://img.youtube.com/vi/K5n2vg3oZa4/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-bench-press-1",
    "name": "Bench Press",
    "environment": "GYM",
    "primaryMuscle": "Pectorales, deltoides anterior, tríceps",
    "description": "El press de banca es el ejercicio rey para desarrollar pecho, hombros anteriores y tríceps.\n\nEs un empuje horizontal que permite mover cargas pesadas de forma segura con la espalda apoyada, ideal para ganar fuerza e hipertrofia en la parte superior del cuerpo.\n\nRequiere estabilidad de hombros y core, y una buena técnica para evitar lesiones y maximizar la implicación del pectoral.\n\nEs uno de los tres levantamientos del powerlifting junto al squat y el deadlift.",
    "cues": "Retrae y deprime los omóplatos antes de desenganchar la barra; manténlos pegados al banco.\nCrea un arco lumbar moderado (natural), pies firmes en el suelo.\nAgarre con los pulgares alrededor de la barra, algo más ancho que hombros.\nDesciende la barra de forma controlada hasta la parte media o inferior del pecho.\nLos codos forman unos 45-75° respecto al cuerpo (no completamente pegados).",
    "commonMistakes": "Rebotar la barra en el pecho: elimina tensión y aumenta riesgo de lesión.\nSeparar los glúteos del banco: invalidación en competición y pérdida de estabilidad.\nElevar los hombros hacia las orejas: sobrecarga del manguito y menos pecho.\nAsimetría en el agarre o descenso: desequilibrios y posible lesión.\nDejar la barra demasiado alta en el pecho: estrés excesivo en hombros.",
    "regressions": "Press con mancuernas para mayor libertad de movimiento.\nPress en máquina guiada o con barra de seguridad.\nPress inclinado con barra o mancuernas (menor carga absoluta).",
    "progressions": "Pausa de 1-2 segundos en el pecho.\nPress con bandas de resistencia para tensión variable.\nBench press con agarre estrecho para más tríceps.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Bench_press.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=gRVjAtPip0Y",
        "thumbnailUrl": "https://img.youtube.com/vi/gRVjAtPip0Y/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "press-pecho-mancuernas-banco-plano",
    "name": "Press de pecho con mancuernas (banco plano)",
    "environment": "GYM",
    "primaryMuscle": "Pectorales, deltoides anterior, tríceps",
    "description": "Empuje horizontal en banco plano para trabajar pecho, con participación de tríceps y hombro anterior. Con mancuernas suele ser más fácil ajustar el agarre y el recorrido a un rango cómodo.\n\nTécnica: Túmbate en banco plano con pies firmes. Mancuernas a los lados del pecho con muñecas rectas. Escápulas atrás y abajo, sin encogerlas. Baja controlado con codos a ~45–60° respecto al torso. Sube vertical sobre el pecho.",
    "cues": "Pies firmes y postura estable\nMuñecas rectas: mancuerna encima del antebrazo\nHombros atrás y abajo (sin encoger)\nCodos a ~45–60°\nBaja controlado, sube vertical sobre el pecho",
    "commonMistakes": "Codos demasiado abiertos: más estrés de hombro; ajusta a 45–60°.\nMuñecas dobladas: alinea mancuerna con antebrazo.\nRebotar abajo o perder tensión: tempo 2–3s bajada.\nPerder la postura del hombro y encoger.",
    "regressions": "Press en el suelo (floor press): limita el rango y suele ser más amable con hombros.\nMenos carga + pausa corta abajo (control).\nMáquina de chest press si falta estabilidad.",
    "progressions": "Más carga manteniendo forma.\nPausa 1s abajo o tempo (bajada 2–3s).\nPress inclinado con mancuernas (más énfasis parte superior).",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Dumbbell-bench-press-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Vc63DPUoA40",
        "thumbnailUrl": "https://img.youtube.com/vi/Vc63DPUoA40/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "press-inclinado-mancuernas",
    "name": "Press inclinado con mancuernas",
    "environment": "GYM",
    "primaryMuscle": "Pectorales, deltoides anterior, tríceps",
    "description": "Variante del press de pecho con banco inclinado (15–30° típico) para dar más énfasis a la parte alta del pecho y deltoide anterior, con mancuernas para un recorrido natural.\n\nTécnica: Banco a inclinación moderada (mejor poco que mucho para no convertirlo en press de hombro). Pies firmes, glúteos y parte alta de la espalda apoyados; pecho estable, sin exagerar arco lumbar. Baja las mancuernas controlado hacia los lados del pecho (no al cuello), con codos en diagonal (ni pegados ni en cruz). Sube empujando arriba y un poco hacia dentro, sin chocar mancuernas. Muñecas neutras, antebrazos lo más verticales posible en la parte baja.",
    "cues": "Banco poco inclinado (moderado)\nHombros atrás y abajo\nBaja controlado, sin rebotar\nMuñecas neutras\nSube sólido sin chocar mancuernas",
    "commonMistakes": "Inclinación demasiado alta (se vuelve press de hombro).\nRebotar abajo o acortar rango por exceso de peso.\nMuñecas dobladas hacia atrás.\nCodos demasiado abiertos (molestia de hombro).",
    "regressions": "Menos peso + tempo (bajada 2–3s)\nRango un poco más corto si hay molestia (sin dolor raro)\nPress inclinado en máquina si necesitas aún más estabilidad",
    "progressions": "Pausa 1s abajo (sin rebotar)\nTempo más lento\nMás carga manteniendo el mismo control",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/9/97/Dumbbell-incline-bench-press-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=sK4Rvug6ufo",
        "thumbnailUrl": "https://img.youtube.com/vi/sK4Rvug6ufo/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "press-banca-barra",
    "name": "Press de banca con barra",
    "environment": "GYM",
    "primaryMuscle": "Pectorales, deltoides anterior, tríceps",
    "description": "Press horizontal con barra en banco plano para trabajar pecho, tríceps y hombro anterior. Es un básico de gym y muy compartible en la ruta pública.\n\nTécnica: Ojos debajo de la barra; pies firmes en el suelo. Espalda alta fija: hombros atrás y abajo (como meterlos en el banco). Agarre a anchura cómoda; muñecas neutras (barra sobre la base de la palma, no en los dedos). Baja controlado al pecho (zona media/alta del pecho), sin rebotar. Sube en línea estable sin despegar glúteos del banco; evita bloquear con golpe. Si puedes, usa topes/seguridades o un spotter.",
    "cues": "Hombros atrás y abajo (fijos en el banco)\nMuñecas neutras: barra sobre la base de la palma\nBaja controlado al pecho sin rebotar\nPies firmes: torso estable\nSube sólido sin bloquear con golpe",
    "commonMistakes": "Rebotar la barra en el pecho.\nMuñecas dobladas hacia atrás.\nCodos demasiado abiertos (molestia de hombro).\nPerder la posición de hombros (se van hacia delante).\nGlúteos se despegan del banco.",
    "regressions": "Menos peso + pausa 1s en el pecho (sin rebotar)\nPress con mancuernas (ya en catálogo) si necesitas recorrido más natural\nPress en máquina si buscas aún más estabilidad",
    "progressions": "Pausa 1s en el pecho\nTempo: bajada 2–3s\nMás carga manteniendo la misma forma",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Bench_press_1.jpg",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=rT7DgCr-3pg",
        "thumbnailUrl": "https://img.youtube.com/vi/rT7DgCr-3pg/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-deadlift-2",
    "name": "Deadlift",
    "environment": "GYM",
    "primaryMuscle": "Espalda baja, isquiotibiales, glúteos, trapecio",
    "description": "El peso muerto es uno de los ejercicios más completos y funcionales que existen.\n\nTrabaja toda la cadena posterior: espalda baja, isquiotibiales, glúteos, trapecio y antebrazos.\n\nSimula el gesto de levantar un objeto pesado del suelo, por lo que traslada muy bien a la vida diaria y al rendimiento deportivo.\n\nEs uno de los tres grandes del powerlifting y un pilar para desarrollar fuerza total del cuerpo cuando se ejecuta con buena técnica.",
    "cues": "Coloca la barra sobre la mitad del pie; espinillas cerca o tocando la barra.\nAgarre justo fuera de las piernas, brazos rectos como cables.\nPecho alto, espalda neutral (sin redondear ni hiperextender).\nTensa todo el cuerpo antes de levantar; empuja el suelo con los pies.\nExtiende cadera y rodillas de forma simultánea; bloquea sin hiperextender la lumbar.",
    "commonMistakes": "Redondear la espalda lumbar: alto riesgo de hernia o lesión discal.\nTirar con los brazos en lugar de empujar con las piernas: brazos deben estar pasivos.\nArrancar con la barra lejos del cuerpo: palanca desfavorable y espalda en riesgo.\nHiperextensión lumbar al bloquear: compresión innecesaria.\nEncoger los hombros al final: evita el encogimiento excesivo de trapecio.",
    "regressions": "Deadlift rumano (RDL) para enfatizar isquios.\nPeso muerto con kettlebell o hex bar (menor exigencia técnica).\nRack pull (barra elevada) para reducir el rango.",
    "progressions": "Pausa a la altura de la rodilla o justo por debajo.\nDeficit deadlift (de pie sobre disco) para mayor rango.\nAgarre alterno o hook grip para más carga.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Fit_young_man_doing_deadlift_exercise_in_gym.jpg",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=-4qRntuXBSc",
        "thumbnailUrl": "https://img.youtube.com/vi/-4qRntuXBSc/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-dumbbell-row-3",
    "name": "Dumbbell Row",
    "environment": "GYM",
    "primaryMuscle": "Dorsales, romboides, bíceps",
    "description": "El remo con mancuerna a una mano es un ejercicio de tracción horizontal excelente para la espalda.\n\nAl ser unilateral, permite mayor rango de movimiento que el remo con barra y ayuda a corregir desequilibrios entre el lado izquierdo y derecho.\n\nTrabaja dorsales, romboides, trapecio medio y bíceps, construyendo una espalda gruesa y funcional.\n\nPuede ejecutarse apoyando la mano libre en un banco o con apoyo en la rodilla para mayor estabilidad.",
    "cues": "Apoya la mano y la rodilla en un banco; espalda paralela al suelo y neutral.\nDeja colgar el brazo con la mancuerna; inicia con depresión escapular.\nTira del codo hacia la cadera, como si tiraras de un remo.\nSiente la contracción en el dorsal, no solo en el bíceps.\nMantén el hombro estable; evita que rote hacia adelante.",
    "commonMistakes": "Girar el torso para \"ayudar\" con el peso: reduce el trabajo del dorsal.\nTirar con el brazo en lugar de conducir con el codo: menos espalda, más bíceps.\nEncoger los hombros hacia las orejas: sobrecarga del trapecio superior.\nDescender sin control o balancear: reduce la tensión y aumenta riesgo de tirón.\nNo alcanzar la contracción completa: rango incompleto.",
    "regressions": "Remo con banda elástica anclada.\nRemo en máquina sentado (gu-FM-ado).\nRemo inclinado con mancuernas apoyando el pecho en banco inclinado.",
    "progressions": "Pausa de 1-2 segundos en la contracción máxima.\nRemo renegado (en posición de flexión): mayor exigencia de core.\nRemo con agarre neutro o prono para variar el estímulo.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=gfUg6qWohTk",
        "thumbnailUrl": "https://img.youtube.com/vi/gfUg6qWohTk/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "remo-barra",
    "name": "Remo con barra",
    "environment": "GYM",
    "primaryMuscle": "Dorsales, romboides, bíceps",
    "description": "Remo con barra en bisagra para trabajar espalda con control, sin balanceos y manteniendo postura estable.",
    "cues": "Espalda estable, cadera atrás\nBarra hacia el ombligo\nCodos atrás\nBaja lento",
    "commonMistakes": "Balancear el torso para mover más peso\nRedondear la espalda por exceso de carga\nEncoger hombros al tirar\nSoltar la bajada sin control",
    "regressions": "Menos peso + pausa 1s arriba\nRemo con pecho apoyado (banco inclinado)\nRemo en polea (ya en catálogo)",
    "progressions": "Tempo: bajada 2–3s\nPausa 1–2s arriba sin balanceo\nMás carga manteniendo técnica",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/0/04/Barbell-bent-over-row-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=vT2GjY_Umpw",
        "thumbnailUrl": "https://img.youtube.com/vi/vT2GjY_Umpw/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "remo-mancuerna-una-mano-banco",
    "name": "Remo con mancuerna a una mano (banco)",
    "environment": "GYM",
    "primaryMuscle": "Dorsales, romboides, bíceps",
    "description": "Tirón horizontal unilateral para trabajar espalda (especialmente dorsales) con apoyo en banco para ganar estabilidad y reducir trampas de balanceo. Dorsal ancho y musculatura de la espalda media (romboides/trapecio) como protagonistas; bíceps como asistente; core como estabilizador.\n\nTécnica: Apoyo estable (mano y rodilla del mismo lado en el banco; otro pie firme). Espalda larga y neutral, torso inclinado sin redondear. Brazo de trabajo colgando; tira llevando el codo hacia atrás (cerca del costado) sin girar el tronco. Baja controlado hasta estirar el brazo.",
    "cues": "Codo hacia la cadera, cerca del costado\nHombro lejos de la oreja\nNo gires el tronco: controla la postura\nSube fuerte, baja lento",
    "commonMistakes": "Rotar el tronco para ayudar: baja peso y limita el rango.\nEncoger el hombro al tirar: piensa hombro abajo y atrás.\nTirar con la mano en vez de guiar con el codo: cue codo atrás.\nRebotar abajo: controla la bajada 2–3s.",
    "regressions": "Menos peso + pausa 1s arriba (mejor control)\nRemo con apoyo de pecho (banco inclinado) si cuesta estabilizar\nRecorrido más corto si hay compensación",
    "progressions": "Más carga manteniendo cero rotación\nTempo: bajada 2–3s o pausa abajo con control\nVariante sin apoyo (solo con técnica sólida)",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/6/67/DumbbellBentOverRow.JPG",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=jO5gv181MGg",
        "thumbnailUrl": "https://img.youtube.com/vi/jO5gv181MGg/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-squat-4",
    "name": "Squat",
    "environment": "GYM",
    "primaryMuscle": "Cuádriceps, glúteos, isquiotibiales, core",
    "description": "El squat con barra es considerado el rey de los ejercicios de pierna.\n\nDesarrolla cuádriceps, glúteos, isquiotibiales y exige un core fuerte para mantener la posición.\n\nEs un patrón fundamental: sentadilla, que usamos a diario al sentarnos y levantarnos.\n\nPermite cargar mucho peso y progresar de forma sistemática, siendo uno de los tres levantamientos del powerlifting y base de cualquier programa de fuerza.",
    "cues": "Pies a la anchura de hombros o algo más, dedos ligeramente hacia fuera.\nBarra apoyada en trapecio o deltoides posteriores (high/low bar según variante).\nPecho alto, core activo, mirada al frente o ligeramente arriba.\nBaja flexionando cadera y rodillas hasta que el muslo esté al menos paralelo al suelo.\nLas rodillas siguen la línea de los pies (no se meten hacia dentro).",
    "commonMistakes": "Valgo de rodillas (rodillas hacia dentro): riesgo de lesión de LCA y menisco.\nRedondear la espalda baja (butt wink): compresión lumbar.\nElevar los talones del suelo: desestabiliza y traslada carga a rodillas.\nInclinar el torso en exceso hacia adelante: puede indicar falta de movilidad de cadera.\nNo alcanzar la profundidad adecuada: trabajo muscular incompleto.",
    "regressions": "Goblet squat con kettlebell para aprender el patrón.\nSquat con barra de seguridad (safety bar) o box squat.\nSquat con banda de resistencia como asistencia.",
    "progressions": "Squat con pausa de 2-3 segundos en el agujero.\nSquat profundo (ATG) si la movilidad lo permite.\nFront squat para mayor exigencia de core y cuádriceps.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/46/Squat.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "sentadilla-goblet",
    "name": "Sentadilla goblet",
    "environment": "GYM",
    "primaryMuscle": "Cuádriceps, glúteos, isquiotibiales, core",
    "description": "Sentadilla con carga frontal (mancuerna o kettlebell pegada al pecho). Es una progresión lógica desde sentadilla sin peso: ayuda a mantener el torso más vertical y suele ser más fácil de sentir la técnica sin necesitar barra.\n\nTécnica: Sujeta la mancuerna/kettlebell a la altura del pecho, cerca del cuerpo. Pies a anchura cómoda, puntas ligeramente abiertas. Baja en sentadilla manteniendo el peso repartido en todo el pie. Rodillas siguen la dirección de los pies. Llega a la profundidad que puedas sin perder control (sin redondear la espalda al final). Sube empujando el suelo, manteniendo el pecho estable.",
    "cues": "Peso pegado al pecho\nTrípode del pie: talón y bases de los dedos\nRodillas siguen a los pies\nBaja controlado, sube sólido",
    "commonMistakes": "Colapsar rodillas hacia dentro: reduce carga y piensa abre el suelo.\nLevantar talones: ajusta postura/anchura y baja hasta donde controles.\nRedondear al fondo: recorta profundidad.\nBajar sin control y rebotar.",
    "regressions": "Goblet a caja (box squat) para limitar profundidad\nMenos peso + pausa 1s abajo con control\nSentadilla sin peso si hace falta volver atrás",
    "progressions": "Más carga manteniendo forma\nTempo: bajada 3s\nPausa 1–2s abajo",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Goblet_squat.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=MeIiIdhvXT4",
        "thumbnailUrl": "https://img.youtube.com/vi/MeIiIdhvXT4/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "sentadilla-barra-trasera",
    "name": "Sentadilla trasera con barra",
    "environment": "GYM",
    "primaryMuscle": "Cuádriceps, glúteos, isquiotibiales, core",
    "description": "Sentadilla con barra en la parte alta de la espalda para trabajar piernas y glúteos con un patrón básico de fuerza. Para MVP, es un ejercicio core de gym y muy compartible.\n\nTécnica: Usa rack: ajusta la altura para desencajar con control (sin ponerte de puntillas). Coloca la barra en la parte alta de la espalda (no en el cuello). Aprieta la parte alta de la espalda (espalda fuerte). Pies a anchura cómoda; mira al frente; abdomen firme. Baja llevando cadera y rodillas a la vez, con rodillas siguiendo la dirección de los pies. Profundidad: la máxima que puedas mantener con espalda estable y control (sin colapsar abajo). Sube empujando el suelo, manteniendo el tronco estable y la barra encima del medio del pie. Seguridad: si dudas, usa barras de seguridad del rack o spotter.",
    "cues": "Barra estable, espalda fuerte\nRodillas siguen a los pies\nBaja controlado sin rebotar\nSube empujando el suelo\nUsa barras de seguridad si dudas",
    "commonMistakes": "Talones se levantan (pierdes base).\nRodillas colapsan hacia dentro.\nPerder tensión y doblar la espalda abajo.\nRebotar en el fondo para subir.\nDesencajar/encajar la barra sin control.",
    "regressions": "Sentadilla goblet (ya en catálogo) para aprender patrón\nSentadilla a caja (altura que te permita control)\nMenos carga + rango perfecto",
    "progressions": "Pausa 1s abajo (sin perder tensión)\nTempo: bajada 2–3s\nMás carga manteniendo técnica",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Squats-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=1oed-UmAxFs",
        "thumbnailUrl": "https://img.youtube.com/vi/1oed-UmAxFs/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-overhead-press-5",
    "name": "Overhead Press",
    "environment": "GYM",
    "primaryMuscle": "Deltoides, tríceps, trapecio superior",
    "description": "La prensa de hombros con barra (overhead press) es el ejercicio fundamental de empuje vertical.\n\nDesarrolla deltoides, tríceps y trapecio superior de forma compuesta, y exige un core estable para evitar arquear la espalda.\n\nSe puede ejecutar de pie (mayor implicación del core) o sentado (más aislamiento de hombros).\n\nEs uno de los patrones básicos de fuerza: empuje por encima de la cabeza, trasladable a la vida diaria y al rendimiento deportivo.\n\nPermite progresar con carga de forma sistemática cuando la técnica es correcta.",
    "cues": "Agarre algo más ancho que los hombros; pulgares alrededor de la barra.\nBarra apoyada en la parte alta del pecho o clavícula al inicio.\nCodos ligeramente hacia adelante (no en línea con la barra).\nEmpuja la barra en línea recta sobre la cabeza, sin dejarla ir hacia atrás.\nCore y glúteos tensos; evita arquear la lumbar en exceso.\nBloquea los codos arriba con la barra sobre la línea de la cabeza.",
    "commonMistakes": "Arquear la espalda en exceso (hiperextensión lumbar): sobrecarga lumbar.\nIniciar el movimiento con las piernas (push press cuando buscas press estricto): no cuenta como repetición estricta.\nDejar caer la barra detrás de la cabeza: estrés innecesario en hombros.\nNo bloquear completamente arriba: rango incompleto.\nCodos que se abren en exceso: puede provocar pinzamiento.\nBarra que se desvía hacia delante o atrás: trabaja la estabilidad.",
    "regressions": "Press con mancuernas sentado (mayor libertad de muñeca).\nLandmine press (ángulo fijo, menor exigencia).\nPress con barra desde soportes a la altura de los hombros.",
    "progressions": "Press estricto con pausa en la parte inferior.\nPush press (ayuda de piernas) para más carga.\nJerk para atletas avanzados.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=M2rwvNhTOu0",
        "thumbnailUrl": "https://img.youtube.com/vi/M2rwvNhTOu0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "press-hombros-mancuernas-sentado",
    "name": "Press de hombros con mancuernas (sentado)",
    "environment": "GYM",
    "primaryMuscle": "Deltoides, tríceps, trapecio superior",
    "description": "Empuje vertical sentado para fortalecer hombros y tríceps con técnica estable y controlada.",
    "cues": "Costillas abajo y abdomen firme\nMuñecas rectas: mancuerna encima del antebrazo\nCodos un pelín delante (no completamente abiertos)\nSube vertical, no hacia delante\nBaja controlado sin perder postura",
    "commonMistakes": "Arquear la zona lumbar para ayudar\nEmpujar hacia delante en lugar de vertical\nMuñecas dobladas hacia atrás\nSubir a tirones o rebotar abajo\nIgnorar dolor/pinzamiento en el hombro",
    "regressions": "Menos peso y rango cómodo manteniendo control\nAgarre neutro (palmas mirándose)\nMáquina de press de hombros",
    "progressions": "Más carga manteniendo costillas abajo\nPausa arriba o bajada lenta\nVersión de pie",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/1/15/Dumbbell-shoulder-press-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=poD_-zaG9hk",
        "thumbnailUrl": "https://img.youtube.com/vi/poD_-zaG9hk/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "press-militar-barra",
    "name": "Press militar con barra",
    "environment": "GYM",
    "primaryMuscle": "Deltoides, tríceps, trapecio superior",
    "description": "Press militar con barra de pie para trabajar hombros con control, manteniendo el tronco estable y una línea vertical de la barra.",
    "cues": "Glúteos firmes, costillas tranquilas\nBarra cerca de la cara\nMuñecas neutras\nArriba: barra sobre hombros\nBaja controlado sin rebote",
    "commonMistakes": "Hiperextender lumbar para compensar\nEmpujar la barra hacia delante (pierdes línea)\nMuñecas dobladas hacia atrás\nEncoger hombros y perder control",
    "regressions": "Menos peso + rango perfecto\nPress sentado si necesitas más estabilidad\nPress con mancuernas si te da mejor recorrido",
    "progressions": "Pausa 1s arriba (control)\nTempo en la bajada 2–3s\nMás carga manteniendo la misma línea",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Barbell_shoulder_press_1.svg/764px-Barbell_shoulder_press_1.svg.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=wol7Hko8RhY",
        "thumbnailUrl": "https://img.youtube.com/vi/wol7Hko8RhY/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-lat-pulldown-6",
    "name": "Lat Pulldown",
    "environment": "GYM",
    "primaryMuscle": "Dorsales, bíceps, romboides",
    "description": "El jalón al pecho en polea (lat pulldown) es el ejercicio de tracción vertical por excelencia en el gimnasio.\n\nDesarrolla dorsales, bíceps y romboides con menor exigencia técnica que las dominadas, por lo que es ideal para principiantes o para trabajar la espalda con carga controlada.\n\nEl agarre (ancho, estrecho, prono o neutro) modula la implicación de dorsal y bíceps.\n\nPermite progresar en fuerza de tracción antes de dominar las dominadas con peso corporal.\n\nEs fundamental mantener el pecho alto y conducir el movimiento con los codos, no con los brazos.",
    "cues": "Siéntate con los muslos sujetos por el rodillo; agarre según objetivo (ancho para más dorsal, estrecho para más bíceps).\nPecho hacia adelante, hombros deprimidos (omóplatos hacia abajo) al inicio.\nTira de la barra llevando los codos hacia las costillas o el lateral del torso.\nSiente la contracción en el dorsal, no solo en los brazos.\nBaja la barra hasta la parte alta del pecho o la clavícula.\nSube con control hasta extensión completa de brazos sin dejar que los hombros se encajen.",
    "commonMistakes": "Tirar con los brazos en lugar de conducir con los codos: menos trabajo de espalda.\nInclinar el torso demasiado hacia atrás: se convierte en un remo y quita tensión al dorsal.\nEncoger los hombros hacia las orejas al subir: sobrecarga del trapecio y riesgo de lesión.\nRango incompleto: no bajar lo suficiente o no estirar del todo arriba.\nBalancear el torso para impulsar: reduce la efectividad y puede lesionar la lumbar.",
    "regressions": "Remo con banda anclada a la altura del pecho.\nLat pulldown con menor peso hasta dominar el patrón.\nAustralian pull-up o remo invertido en barra baja.",
    "progressions": "Jalón con pausa de 1-2 segundos en la contracción.\nPull-up asistido con banda para transición a peso corporal.\nJalón con agarre neutro o con triángulo para variar el estímulo.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=OcFCHdQHjVU",
        "thumbnailUrl": "https://img.youtube.com/vi/OcFCHdQHjVU/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "jalon-al-pecho",
    "name": "Jalón al pecho (lat pulldown)",
    "environment": "GYM",
    "primaryMuscle": "Dorsales, bíceps, romboides",
    "description": "Tirón vertical en máquina para trabajar espalda (sobre todo dorsales) con un setup fácil de estandarizar. La clave es hacerlo sin comprometer hombro ni zona lumbar.\n\nTécnica (ACE Fitness): Ajusta el pad de muslos para quedar bien anclado. Brace (abdomen firme) y evita arquear la zona lumbar. Empieza con brazos arriba y escápulas abajo y atrás. Inicia tirando primero bajando escápulas y luego lleva la barra hacia la parte alta/media del pecho, con los codos bajando hacia el suelo. Para cuando los codos dejan de bajar y empiezan a ir hacia atrás. Sube controlado hasta extensión de codos.",
    "cues": "Costillas abajo: abdomen firme\nHombros abajo y atrás antes de tirar\nCodos hacia el suelo\nBarra al pecho alto/medio sin balanceo\nSube controlado",
    "commonMistakes": "Tirar con balanceo o exceso de inclinación: baja peso y controla el torso.\nHombros a las orejas al inicio: piensa en bajar escápulas primero.\nPasarte del rango y seguir tirando cuando el codo ya va hacia atrás: recorta ahí.\nSubir de golpe sin control.",
    "regressions": "Menos carga + recorrido perfecto\nAgarres/handles más cómodos (neutro) si el hombro lo agradece\nJalón con banda para aprender patrón",
    "progressions": "Pausa 1–2s abajo\nTempo: subida controlada 2–3s\nMás carga manteniendo forma",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Close-grip-front-lat-pull-down-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=SALxEARiMkw",
        "thumbnailUrl": "https://img.youtube.com/vi/SALxEARiMkw/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "dominadas-asistidas-maquina",
    "name": "Dominadas asistidas en máquina",
    "environment": "GYM",
    "primaryMuscle": "Dorsales, bíceps, romboides",
    "description": "Versión asistida de dominadas usando una máquina con rodillera/plataforma y stack de peso. Sirve para: practicar el patrón de dominada con técnica limpia, ajustar la dificultad de forma muy gradual (más asistencia = más fácil), acumular volumen sin kipping ni balanceos.\n\nTécnica: Ajusta la asistencia (más peso en el stack = más ayuda). Agarra la barra (prono o neutro) y colócate con rodillas en la almohadilla (o pies en plataforma según máquina). Empieza en colgado activo: hombros abajo, sin encoger. Sube sin balanceo, pensando pecho hacia la barra. Baja controlado hasta brazos estirados sin colgarte pasivo. Mantén el torso estable.",
    "cues": "Más asistencia = más fácil (ajusta el stack)\nEmpieza en colgado activo (hombros abajo)\nSube sin balanceo: pecho hacia la barra\nBaja controlado sin colgarte pasivo",
    "commonMistakes": "Encoger hombros al inicio (trapecio domina): baja carga y repite colgado activo.\nRebotar con la rodillera: pausa 0.5–1s abajo, control.\nAcortar rango por orgullo: mejor rango completo con más asistencia.\nHiperextender lumbar para llegar: costillas tranquilas, core firme.",
    "regressions": "Más asistencia (sube el peso del stack)\nIsométricos arriba 3–10s con mucha asistencia\nNegativas: sube con ayuda (más asistencia) y baja 3–5s",
    "progressions": "Menos asistencia (baja el peso del stack)\nPausa 1s arriba\nSeries de calidad: mismas reps, menos ayuda semana a semana",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Dip_and_pull-up_machine.jpg/960px-Dip_and_pull-up_machine.jpg",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=THSFzwAqYgk",
        "thumbnailUrl": "https://img.youtube.com/vi/THSFzwAqYgk/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "remo-sentado-polea",
    "name": "Remo sentado en polea (seated cable row)",
    "environment": "GYM",
    "primaryMuscle": "Dorsales, romboides, bíceps",
    "description": "Tirón horizontal en polea (agarre estrecho o triángulo) para trabajar espalda media y dorsales, con un patrón fácil de estandarizar en gimnasio.\n\nTécnica: Siéntate con pies firmes en la plataforma y rodillas ligeramente flexionadas. Pecho orgulloso, cuello largo, abdomen firme. Empieza con brazos estirados sin redondear la espalda. Inicia el tirón llevando hombros abajo y atrás (sin encoger) y luego codos hacia atrás. Termina cuando el agarre llega al torso y sigues estable (sin echarte hacia atrás). Vuelve lento al inicio, manteniendo postura.",
    "cues": "Pecho alto y abdomen firme\nHombros lejos de las orejas\nTira con codos, sin encoger\nCero balanceo: controla ida y vuelta",
    "commonMistakes": "Balanceo (tirar con la espalda baja): baja peso y recorta el rango.\nEncoger hombros al tirar: piensa hombros abajo.\nRedondear al estirar: llega al final con control, sin colapsar.\nSoltar la vuelta sin control.",
    "regressions": "Menos carga + pausa 1s con escápulas colocadas\nRecorrido algo más corto si pierdes postura\nAgarre neutro si es más cómodo",
    "progressions": "Tempo: vuelta 2–3s\nPausa 1–2s al final sin balanceo\nMás carga manteniendo técnica",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Cable-seated-rows-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=7o2oolbmzeI",
        "thumbnailUrl": "https://img.youtube.com/vi/7o2oolbmzeI/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "face-pull-polea",
    "name": "Face pull en polea",
    "environment": "GYM",
    "primaryMuscle": "Deltoides posteriores, trapecio, romboides",
    "description": "Tirón hacia la cara con cuerda para trabajar deltoide posterior y musculatura de la espalda alta (rotación externa / estabilidad escapular). Muy útil como complemento de empujes y para equilibrar hombros.\n\nTécnica: Polea alta con cuerda. Postura estable, abdomen suave activo, sin arquear lumbar. Empieza con brazos extendidos y hombros abajo. Tira llevando las manos hacia la cara/ojos y separando puntas de la cuerda al final. Codos altos pero sin subir hombros a las orejas. Vuelve lento al inicio.",
    "cues": "Hombros lejos de orejas\nTira hacia la cara\nSepara la cuerda al final\nVuelve lento y controlado",
    "commonMistakes": "Encoger hombros: baja peso, piensa hombros abajo.\nConvertirlo en remo (codos pegados abajo): codos más altos.\nArqueo lumbar o balanceo: reduce peso y fija postura.\nSoltar la vuelta sin control.",
    "regressions": "Menos peso + pausa 1s al final\nRango más corto si molesta",
    "progressions": "Pausa 1–2s al final\nTempo: vuelta 2–3s\nMás carga sin encoger hombros",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Cable-face-pull-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=rep-qVOkqgk",
        "thumbnailUrl": "https://img.youtube.com/vi/rep-qVOkqgk/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-cable-fly-7",
    "name": "Cable Fly",
    "environment": "GYM",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "aperturas-peck-deck",
    "name": "Aperturas en máquina (peck deck)",
    "environment": "GYM",
    "primaryMuscle": "Pectorales",
    "description": "Apertura de brazos en máquina para trabajar pectorales con recorrido guiado. Útil en MVP: estándar en gym, fácil de registrar, menos fricción técnica que cable fly.\n\nTécnica: Ajusta asiento para que las manos queden a una altura cómoda (aprox. a la altura del pecho). Espalda apoyada y costillas tranquilas (sin arquear lumbar). Empieza con un rango que no te tire del hombro al abrir. Junta los brazos sin encoger hombros y sin perder el apoyo de la espalda. Vuelve lento: controla la apertura, sin rebote.",
    "cues": "Hombros lejos de orejas\nEspalda apoyada y pecho estable\nRango cómodo: no fuerces la apertura\nCierra controlado, vuelve lento",
    "commonMistakes": "Abrir demasiado y sentir pinchazo/tensión rara en hombro: recorta rango.\nEncoger hombros al cerrar: baja peso y hombros abajo.\nRebotar o soltar la vuelta: tempo lento.\nArquear la zona lumbar para hacer fuerza.",
    "regressions": "Menos peso + rango parcial limpio\nPausa 1s al cerrar con poco peso",
    "progressions": "Tempo: apertura 2–3s\nPausa 1s al cerrar sin encoger\nMás carga manteniendo el mismo rango controlado",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/8/87/Butterfly-machine-2.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Z57CtFmRMxA",
        "thumbnailUrl": "https://img.youtube.com/vi/Z57CtFmRMxA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-leg-curl-8",
    "name": "Leg Curl",
    "environment": "GYM",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "curl-femoral-sentado",
    "name": "Curl femoral sentado (máquina)",
    "environment": "GYM",
    "primaryMuscle": "Isquiotibiales",
    "description": "Aísla la flexión de rodilla para trabajar isquiosurales con un setup muy estable. Útil para progresar sin depender tanto de la técnica de bisagra (RDL) cuando quieres trabajo directo de isquios.\n\nTécnica: Ajusta el asiento para que la rodilla quede alineada con el eje/pivote de la máquina. Coloca el rodillo inferior justo por encima del tobillo (no en el pie). Espalda apoyada, abdomen firme, agarre en las asas. Flexiona llevando los talones hacia abajo/atrás (según máquina) sin levantar la cadera del asiento. Pausa breve al final si puedes mantener el control; vuelve lento al inicio sin soltar.",
    "cues": "Rodilla alineada con el pivote\nCadera pegada al asiento\nRecorrido controlado, sin tirones\nVuelta lenta y controlada",
    "commonMistakes": "Cadera se despega al tirar fuerte: baja peso y recorta el rango.\nRodillo demasiado alto/bajo: ajusta cerca del tobillo, sin presionar el talón.\nRebotar en el inicio o al final: controla (sobre todo la vuelta).\nSoltar la vuelta sin control.",
    "regressions": "Menos peso + rango perfecto (aunque sea más corto)\nPausa 1s al final con poco peso para aprender control",
    "progressions": "Tempo: vuelta 2–3s\nPausa 1–2s al final manteniendo cadera pegada\nMás carga sin perder alineación",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Seated-leg-curl-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=_2Kd0d-JEUM",
        "thumbnailUrl": "https://img.youtube.com/vi/_2Kd0d-JEUM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-calf-raise-9",
    "name": "Calf Raise",
    "environment": "GYM",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "abduccion-cadera-maquina",
    "name": "Abducción de cadera en máquina (hip abductor)",
    "environment": "GYM",
    "primaryMuscle": "Glúteos",
    "description": "Máquina sentada para separar las rodillas hacia fuera, enfocada en glúteo medio y estabilizadores de cadera. Es fácil de estandarizar y registrar en MVP.\n\nTécnica: Ajusta el asiento para que estés estable y agarres las asas. Coloca las piernas contra las almohadillas; empieza en un rango cómodo. Abre las piernas sin despegar la cadera del asiento y sin rebotar. Pausa breve si mantienes control, vuelve lento.",
    "cues": "Cadera quieta, sin balanceo\nAbre controlado, vuelve lento\nRango cómodo > rango forzado\nSin rebote",
    "commonMistakes": "Balanceo del tronco para mover más peso: baja carga.\nRebotar al cerrar/abrir: controla (sobre todo la vuelta).\nForzar un rango que te hace perder control: recorta rango.\nDespegar la cadera del asiento.",
    "regressions": "Menos peso + rango cómodo\nPausa 1s en el punto final con poco peso",
    "progressions": "Tempo: vuelta 2–3s\nPausa 1–2s en el punto final con control\nMás carga sin perder postura",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Hip_abductor_machine.jpg/500px-Hip_abductor_machine.jpg",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=b-cxonq03vQ",
        "thumbnailUrl": "https://img.youtube.com/vi/b-cxonq03vQ/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calf-raise",
    "name": "Elevación de talones (calf raises)",
    "environment": "MIXED",
    "primaryMuscle": "Gemelos (pantorrilla)",
    "description": "La elevación de talones fortalece los gemelos y mejora la resistencia del tobillo. El valor está en el rango completo y el control: subir alto, bajar lento y no rebotar.\n\nObjetivo: mover el tobillo (plantarflexión) sin colapsar el pie hacia dentro/afuera y sin impulsos.",
    "cues": "• De pie, pies a anchura de cadera, peso repartido (talón + base dedo gordo + base meñique).\n• Sujétate a una pared o silla si necesitas equilibrio (mejor técnica > equilibrio).\n• Sube lentamente hasta puntillas, sin girar los tobillos.\n• Arriba: pausa 1s y aprieta gemelos.\n• Baja lento 2–3s hasta apoyar el talón por completo.\n• Mantén rodillas estables (ligeramente flexionadas o extendidas, pero sin bloquear con tensión).\n\nCalidad recomendada: 10–20 reps controladas o series de 20–40s con tempo.",
    "commonMistakes": "• Rebotar rápido: reduce reps y usa tempo (sube 2s, baja 3s).\n• Tobillos se van hacia fuera/dentro: distribuye peso en el 'trípode' del pie.\n• Subir poco rango: busca máxima altura controlable.\n• Perder equilibrio y compensar: usa apoyo con mano.\n• Dolor en tendón de Aquiles: reduce rango/volumen y evita rebotes; si persiste, parar.\n\nSEGURIDAD: si hay dolor agudo, inflamación o sensación rara en tobillo/Aquiles, detén y ajusta.",
    "regressions": "REGRESIONES (más fácil)\n• Calf raise con apoyo (mano en pared/silla).\n• Rango parcial sin dolor (si hay sensibilidad).\n• Series más cortas (6–10 reps perfectas) con descansos.",
    "progressions": "PROGRESIONES (más difícil)\n• A una pierna (single-leg calf raise) manteniendo tobillo estable.\n• En escalón para mayor rango (bajar talón por debajo del escalón) solo si no molesta el Aquiles.\n• Pausa arriba 2s + tempo lento.\n• Añadir carga (mancuerna) cuando la técnica sea sólida.",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=YMmgqO8Jo-k",
        "thumbnailUrl": "https://img.youtube.com/vi/YMmgqO8Jo-k/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Calf_raise.gif",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "gym-barbell-row-10",
    "name": "Barbell Row",
    "environment": "GYM",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-incline-press-11",
    "name": "Incline Press",
    "environment": "GYM",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-tricep-pushdown-12",
    "name": "Tricep Pushdown",
    "environment": "GYM",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "extension-triceps-polea",
    "name": "Extensión de tríceps en polea (pushdown)",
    "environment": "GYM",
    "primaryMuscle": "Tríceps",
    "description": "Ejercicio simple en polea para trabajar tríceps con control. Muy fácil de escalar en carga y registrar.\n\nTécnica: Ajusta la polea alta y elige cuerda o barra. Postura estable: pies firmes, abdomen suave activo, torso ligeramente inclinado si hace falta. Codos pegados al cuerpo y hombros abajo (sin encoger). Empieza con antebrazos flexionados y extiende el codo hacia abajo hasta estirar sin bloquear agresivo. Sube controlado sin que los codos se vayan hacia delante.",
    "cues": "Codos pegados y quietos\nHombros abajo: no encoger\nEmpuja hacia el suelo\nSube lento sin mover codos",
    "commonMistakes": "Balanceo del torso para mover peso: baja carga.\nCodos se abren o se van al frente: reduce peso y fija codos.\nHombros encogidos: hombros lejos de orejas.\nSoltar la subida sin control.",
    "regressions": "Menos peso + pausa 1s abajo\nBarra en vez de cuerda si coordinar cuerda cuesta",
    "progressions": "Cuerda (más rango) con control\nTempo: subida 2–3s\nMás carga manteniendo codos estables",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Cable-triceps-pushdown-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=2-LAMcpzODU",
        "thumbnailUrl": "https://img.youtube.com/vi/2-LAMcpzODU/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-bicep-curl-13",
    "name": "Bicep Curl",
    "environment": "GYM",
    "primaryMuscle": "Bíceps",
    "description": "Curl con mancuerna o barra para aislar el bíceps braquial.",
    "cues": "Codos pegados al cuerpo.\nCurl completo sin balancear.\nControla la bajada.\nSupina ligeramente la muñeca al subir.",
    "commonMistakes": "Balancear el torso (cheating).\nCodos que se abren.\nRango incompleto.\nPeso excesivo.",
    "regressions": "Curl con banda, curl con mancuerna ligera.",
    "progressions": "Curl con pausa, hammer curl.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=ykJmrZ5v0Oo",
        "thumbnailUrl": "https://img.youtube.com/vi/ykJmrZ5v0Oo/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "curl-biceps-mancuernas",
    "name": "Curl de bíceps con mancuernas (de pie)",
    "environment": "GYM",
    "primaryMuscle": "Bíceps",
    "description": "Flexión de codo con mancuernas para trabajar bíceps con un patrón muy simple. En MVP conviene por ser universal y fácil de registrar.\n\nTécnica: De pie, pies firmes, abdomen suave pero activo (sin arquear). Brazos a los lados, codos cerca del torso. Sube la mancuerna flexionando el codo sin balancear el cuerpo. Muñeca neutra. Baja lento hasta estirar el codo sin soltar la carga.",
    "cues": "Codos cerca del cuerpo\nSin balanceo: torso estable\nMuñeca neutra\nSube controlado, baja lento",
    "commonMistakes": "Balanceo para mover más peso: baja carga.\nCodos que se van hacia delante: vuelve a codos al lado.\nMuñecas dobladas: neutras.\nSoltar la bajada sin control.",
    "regressions": "Menos peso + tempo (bajada 2–3s)\nCurl alterno (una mancuerna cada vez) si coordinar ambas cuesta",
    "progressions": "Pausa 1s arriba\nTempo más lento en la bajada\nCurl inclinado (opcional futuro)",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/8/86/Dumbbell-biceps-curl-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=ykJmrZ5v0Oo",
        "thumbnailUrl": "https://img.youtube.com/vi/ykJmrZ5v0Oo/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "curl-biceps-barra-z",
    "name": "Curl de bíceps con barra Z",
    "environment": "GYM",
    "primaryMuscle": "Bíceps",
    "description": "Curl con barra Z para trabajar bíceps con un agarre que suele ser más cómodo para muñeca/codo que una barra recta. Muy estándar en gym.\n\nTécnica: De pie, pies firmes, abdomen suave activo (sin arquear lumbar). Agarre en la barra Z a anchura cómoda. Codos cerca del cuerpo; sube flexionando codos sin balancear el torso. Muñecas neutras (la barra Z lo facilita). Baja lento hasta extensión controlada (sin soltar).",
    "cues": "Codos quietos cerca del cuerpo\nSin balanceo del torso\nMuñecas neutras\nSube controlado, baja lento",
    "commonMistakes": "Balancear el cuerpo para subir: baja peso.\nCodos se van hacia delante: vuelve a codos al lado.\nSoltar la bajada: controla.\nAgarre demasiado cerrado o incómodo.",
    "regressions": "Menos peso + tempo (bajada 2–3s)\nRecorrido más corto si pierdes control\nCurl en polea (más tensión constante) si mola más — opcional futuro",
    "progressions": "Pausa 1s arriba\nTempo más lento en la bajada\nSeries más pesadas manteniendo forma",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/5/5d/EZ-bar-curl-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=kwG2ipFRgfo",
        "thumbnailUrl": "https://img.youtube.com/vi/kwG2ipFRgfo/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-leg-extension-14",
    "name": "Leg Extension",
    "environment": "GYM",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "extension-cuadriceps-maquina",
    "name": "Extensión de cuádriceps en máquina (leg extension)",
    "environment": "GYM",
    "primaryMuscle": "Cuádriceps",
    "description": "Aísla el cuádriceps con una máquina muy fácil de estandarizar en gym. Útil en MVP porque: poca fricción, fácil de progresar, fácil de registrar.\n\nTécnica: Ajusta la máquina para que la rodilla quede alineada con el eje/pivote. Rodillo justo por encima del tobillo (no sobre el pie). Espalda apoyada y cadera estable: no despegarse del asiento. Extiende la rodilla hasta casi estirar (sin bloquear con golpe). Baja lento hasta el inicio, sin rebote.",
    "cues": "Rodilla alineada con el pivote\nRodillo justo por encima del tobillo\nCadera pegada al asiento\nSube firme, baja lento\nSin rebote ni bloqueo agresivo",
    "commonMistakes": "Subir peso y empezar a despegar cadera: baja carga y/o recorta rango.\nRebotar abajo o arriba: tempo lento.\nBloquear agresivo la rodilla arriba: deja un margen pequeño.\nRodillo mal colocado.",
    "regressions": "Menos peso + rango perfecto\nPausa 1s arriba con poco peso (control, sin bloqueo agresivo)",
    "progressions": "Tempo: bajada 2–3s\nPausa 1s arriba manteniendo control\nMás carga sin perder alineación ni levantar cadera",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Leg-extensions-1-672x1024.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=4ZDm5EbiFI8",
        "thumbnailUrl": "https://img.youtube.com/vi/4ZDm5EbiFI8/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-chest-press-15",
    "name": "Chest Press",
    "environment": "GYM",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-seated-row-16",
    "name": "Seated Row",
    "environment": "GYM",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-lateral-raise-17",
    "name": "Lateral Raise",
    "environment": "GYM",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "elevaciones-laterales-mancuernas",
    "name": "Elevaciones laterales con mancuernas",
    "environment": "GYM",
    "primaryMuscle": "Deltoides",
    "description": "Movimiento simple para trabajar el deltoide lateral (hombro ancho) con poco estrés articular si se hace con peso moderado y control. La clave es evitar encoger hombros y evitar balanceos.\n\nTécnica: De pie, mancuernas a los lados, codo con ligera flexión (no bloqueado). Postura estable: abdomen firme, costillas tranquilas (sin arquear la lumbar). Sube los brazos hacia los lados hasta altura aproximada del hombro (no hace falta más). Muñecas neutras. Baja lento y controlado.",
    "cues": "Peso moderado y control total\nHombros lejos de orejas (sin encoger)\nSube hasta altura de hombro\nMuñecas neutras\nBaja lento y controlado",
    "commonMistakes": "Balanceo para mover más peso: baja carga; si balanceas, es demasiado.\nEncoger hombros (trapecio se lo come): piensa hombros abajo.\nSubir demasiado alto: suele meter trapecio y molestar; quédate en hombro.\nMuñeca doblada: neutra.",
    "regressions": "Menos peso + rango cómodo (hasta donde controles perfecto)\nElevaciones a una mano (más fácil de controlar el balanceo)\nMáquina de elevación lateral si la tienes",
    "progressions": "Pausa 1s arriba (sin encoger)\nTempo: bajada 2–3s\nCable lateral raise cuando la técnica esté sólida",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Dumbbell-lateral-raises-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3VcKaXpzqRo",
        "thumbnailUrl": "https://img.youtube.com/vi/3VcKaXpzqRo/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "gym-romanian-deadlift-18",
    "name": "Romanian Deadlift",
    "environment": "GYM",
    "primaryMuscle": "Isquiotibiales, glúteos, espalda baja",
    "description": "Variante del peso muerto que enfatiza los isquiotibiales y glúteos con menor carga en la espalda baja.",
    "cues": "Pecho alto, ligera flexión de rodillas.\nHinge por la cadera, no por la espalda.\nBarra pegada al cuerpo.\nSiente el estiramiento en los isquios.",
    "commonMistakes": "Doblar demasiado las rodillas (convierte en squat).\nRedondear la espalda al bajar.\nBajar demasiado si se pierde la neutralidad.\nMover la barra lejos de las piernas.",
    "regressions": "RDL con mancuernas, good morning con barra ligera.",
    "progressions": "RDL con pausa, RDL a una pierna.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=CQp5I9KgdXI",
        "thumbnailUrl": "https://img.youtube.com/vi/CQp5I9KgdXI/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "romanian-deadlift",
    "name": "Peso muerto rumano (RDL)",
    "environment": "MIXED",
    "primaryMuscle": "Isquios y glúteos (bisagra de cadera)",
    "description": "El peso muerto rumano (RDL) entrena la bisagra de cadera: cadera va hacia atrás, columna estable y tensión en la parte posterior de las piernas. No es un 'bajar la espalda'; es 'mover la cadera' manteniendo la espalda neutra.\n\nObjetivo: sentir estiramiento controlado en isquios y volver a subir empujando la cadera hacia delante. Si aparece dolor agudo en espalda, para y usa una regresión.",
    "cues": "• Pie a anchura de cadera, peso repartido (planta entera).\n• Rodillas 'suaves': ligera flexión fija (no es una sentadilla).\n• Prepara el torso: 'costillas abajo' + abdomen firme como para recibir un golpe.\n• Bisagra: lleva la cadera hacia atrás como si quisieras tocar una pared con los glúteos.\n• Mantén la espalda neutra (pecho orgulloso, pero sin arquear la zona lumbar).\n• Las pesas rozan muslos y espinillas: recorrido cerca del cuerpo.\n• Baja hasta donde mantengas espalda neutra y notes estiramiento en isquios; no hace falta tocar el suelo.\n• Sube empujando el suelo y llevando la cadera hacia delante; aprieta glúteos arriba SIN hiperextender la espalda.\n• Respira: toma aire y brace antes de bajar/subir; exhala al final de la subida manteniendo control.",
    "commonMistakes": "• Convertirlo en sentadilla (mucha flexión de rodilla): reduce flexión, cadera atrás.\n• Redondear espalda: reduce rango, baja menos, practica bisagra con palo (3 puntos: cabeza-espalda-sacrum).\n• Pesas lejos del cuerpo: pega las pesas a las piernas.\n• Hiperextender arriba: termina 'alto' con glúteos, no arquees lumbar.\n• Bajar demasiado por ego (sin control): el rango correcto es el que mantiene tensión y neutralidad.\n\nSEGURIDAD: si hay dolor agudo, irradiado, hormigueo o mareo, detén. Prioriza técnica y usa regresiones.",
    "regressions": "REGRESIONES (más fácil)\n• Bisagra sin peso (hands-on-hips): practica cadera atrás con espalda neutra.\n• Bisagra con palo: palo tocando cabeza-espalda-sacrum; no perder contacto.\n• RDL con poco rango: baja hasta mitad de tibia o donde mantengas forma.\n• Peso ligero y tempo lento: 3s bajada, 1s pausa, 2s subida.",
    "progressions": "PROGRESIONES (más difícil)\n• Aumenta carga manteniendo técnica.\n• Pausa 1–2s abajo (tensión en isquios) sin redondear.\n• Tempo 3-1-3.\n• RDL a una pierna (solo si dominas el patrón; cadera estable y sin rotación).",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=hQgFixeXdZo",
        "thumbnailUrl": "https://img.youtube.com/vi/hQgFixeXdZo/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://commons.wikimedia.org/wiki/Special:FilePath/Romanian-deadlift-1.png",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "peso-muerto-rumano",
    "name": "Peso muerto rumano (RDL)",
    "environment": "GYM",
    "primaryMuscle": "Isquiotibiales y glúteos",
    "description": "Bisagra de cadera para fortalecer isquios y glúteos con control y espalda neutral.",
    "cues": "Cadera atrás, espalda larga\nRodillas suaves: no es una sentadilla\nBarra/mancuernas pegadas a las piernas\nBaja hasta donde mantengas la espalda neutral\nSube empujando la cadera hacia delante sin arquear la zona lumbar",
    "commonMistakes": "Convertirlo en sentadilla (demasiada rodilla)\nRedondear la espalda para bajar más\nSeparar la barra del cuerpo\nRebotar abajo o perder control\nHiperextender la espalda al final",
    "regressions": "RDL con mancuernas ligeras\nRDL desde bloques/rack (recorrido corto)\nBisagra con palo para aprender postura",
    "progressions": "Más carga manteniendo técnica\nTempo RDL (bajada lenta + pausa)\nRDL a una pierna asistido",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Romanian-deadlift-1.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=2SHsk9AzdjA",
        "thumbnailUrl": "https://img.youtube.com/vi/2SHsk9AzdjA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "peso-muerto-rumano-barra",
    "name": "Peso muerto rumano (barra)",
    "environment": "GYM",
    "primaryMuscle": "Isquiotibiales y glúteos",
    "description": "El peso muerto rumano con barra es una bisagra de cadera: la cadera va hacia atrás con columna estable y tensión en la parte posterior de las piernas. Trabaja sobre todo isquiotibiales y glúteos. Úsalo para fortalecer la cadena posterior y mejorar la técnica de bisagra sin bajar la barra al suelo.\n\nSetup: Barra pegada a las piernas al inicio; pies a anchura de cadera o algo más estrechos; agarre justo fuera de las piernas, brazos rectos.\n\nEjecución: Baja llevando la cadera hacia atrás, manteniendo la tibia lo más vertical posible (ligera flexión de rodilla fija). Mantén la columna neutra (pecho alto, sin redondear ni arquear). El rango correcto es hasta donde notes estiramiento en isquios sin perder la neutralidad lumbar. Subida: empuja el suelo con los pies y lleva la cadera hacia delante; aprieta glúteos arriba sin hiperextender la lumbar.",
    "cues": "Cadera atrás como si cerraras una puerta\nBarra rozando piernas\nCostillas abajo, abdomen firme\nCuello neutro",
    "commonMistakes": "Redondear lumbar: reduce rango y practica bisagra con palo 3 puntos.\nConvertirlo en sentadilla (rodillas demasiado adelante): menos flexión de rodilla, cadera atrás.\nBarra se aleja del cuerpo: mantén la barra pegada a muslos y espinillas.\nRebotar abajo o perder tensión: control en todo el recorrido.\nHiperextender arriba: termina con glúteos sin arquear la espalda.\nDolor agudo en espalda: parar y bajar carga o rango.",
    "regressions": "Bisagra con palo (dowel) 3 puntos\nRDL con mancuernas ligeras\nRack pull/recorrido parcial desde bloques",
    "progressions": "Aumentar carga manteniendo técnica\nTempo 3s bajada\n1.5 reps / pausa en estiramiento",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=jEy_czb3RKA",
        "thumbnailUrl": "https://img.youtube.com/vi/jEy_czb3RKA/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/5/58/Romanian-deadlift-2.png",
        "thumbnailUrl": null
      },
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Romanian_dead_lift_2.svg/500px-Romanian_dead_lift_2.svg.png",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "gym-hack-squat-19",
    "name": "Hack Squat",
    "environment": "GYM",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=3R0SOJ3alTA",
        "thumbnailUrl": "https://img.youtube.com/vi/3R0SOJ3alTA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-push-up-20",
    "name": "Push-up",
    "environment": "HOME",
    "primaryMuscle": "Pectorales, deltoides anterior, tríceps, core",
    "description": "La flexión de brazos (push-up) es un empuje horizontal con peso corporal que no requiere material.\n\nFortalece pecho, hombros anteriores, tríceps y core de forma integrada.\n\nEs el ejercicio básico por excelencia para el tren superior en casa o al aire libre, y permite infinidad de progresiones según el nivel.\n\nPuede adaptarse fácilmente: más fácil apoyando rodillas o manos elevadas, más difícil con pies elevados o variantes a una mano.",
    "cues": "Coloca las manos algo más anchas que los hombros, dedos hacia adelante.\nMantén el cuerpo en una línea recta de cabeza a talones (plank position).\nBaja el pecho controladamente hasta casi tocar el suelo.\nLos codos forman unos 45° respecto al cuerpo (no pegados, no a 90°).\nAprieta glúteos y core para evitar que la cadera se hunda o se eleve.",
    "commonMistakes": "Cadera hundida (forma de U) o elevada (puente): carga excesiva en lumbar.\nCodos a 90° o muy abiertos: mayor estrés en el hombro.\nCuello tenso o mirada hacia adelante: alinea la cabeza con la columna.\nRango incompleto: no bajar lo suficiente o no extender del todo.\nSeparar los codos del cuerpo en exceso: riesgo de lesión de hombro.",
    "regressions": "Push-up en pared (vertical) para principiantes.\nPush-up con rodillas apoyadas (modificado).\nPush-up con manos en superficie elevada (mesa, banco).",
    "progressions": "Diamond push-up (manos juntas) para más tríceps.\nPush-up con pies elevados.\nArcher push-up o push-up a una mano asistido.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "push-up",
    "name": "Flexiones (push-up)",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Pectoral / tríceps / hombro",
    "description": "Ejercicio básico de empuje con peso corporal para pecho, hombros y tríceps, con alta demanda de control del tronco.\n\nObjetivo: subir y bajar el cuerpo como una plancha rígida, sin hundir la cintura ni elevar la cadera.",
    "cues": "1) Colócate en plancha alta: manos al suelo ligeramente más anchas que hombros; dedos abiertos; antebrazos verticales.\n2) Activa glúteos y abdomen: piensa en \"cerrar costillas\" y mantener pelvis neutra (sin arquear lumbar).\n3) Hombros \"abajo y atrás\" suave: evita encogerlos hacia las orejas.\n4) Baja controlado: codos a ~30–60° respecto al tronco (no totalmente pegados, no en cruz).\n5) Profundidad: pecho hacia el suelo sin perder la línea del cuerpo; cuello neutro (mirada al suelo a ~30 cm).\n6) Sube empujando el suelo: termina con codos extendidos sin bloquear agresivo; mantén la plancha.",
    "commonMistakes": "• Cadera hundida / lumbar arqueada: suele cargar la zona baja. Solución: reduce rango o usa regresión (incline / rodillas) y aprieta glúteos.\n• Codos en cruz (90°): puede molestar hombros. Solución: codos a 30–60° y manos un poco más cerca.\n• Hombros hacia orejas: falta control escapular. Solución: \"mete hombros en los bolsillos\" y empuja el suelo manteniendo cuello largo.\n• Cabeza adelantada: tensa cuello. Solución: cuello neutro, mira al suelo.\n• Reps rápidas sin control: aumenta riesgo y baja calidad. Solución: tempo 2s bajada, 1s subida.\n\nSEGURIDAD: Si hay dolor agudo en hombro/muñeca/codo, para. Ajusta ángulo (incline), anchura de manos o reduce rango. Si persiste, evita el ejercicio y consulta a un profesional.",
    "regressions": "REGRESIONES (más fácil)\n• Flexión inclinada (manos en banco/mesa): misma técnica, menos carga.\n• Flexión con rodillas: desde plancha, apoya rodillas manteniendo cadera alineada.\n• Rango parcial: baja solo hasta donde mantengas forma perfecta.",
    "progressions": "PROGRESIONES (más difícil)\n• Flexión con pausa: 1–2s de pausa cerca del suelo sin colapsar.\n• Flexión tempo: 3–4s bajada.\n• Flexión diamante (tríceps): manos más juntas (solo si muñecas/hombros lo toleran).\n• Flexión declinada: pies elevados (más carga en hombro/pecho superior).",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=IODxDxX7oi4",
        "thumbnailUrl": "https://img.youtube.com/vi/IODxDxX7oi4/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://commons.wikimedia.org/wiki/Special:FilePath/Pushups.gif",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "home-bodyweight-squat-21",
    "name": "Bodyweight Squat",
    "environment": "HOME",
    "primaryMuscle": "Cuádriceps, glúteos, isquiotibiales",
    "description": "La sentadilla con peso corporal es la base del patrón de squat sin necesidad de material.\n\nDesarrolla cuádriceps, glúteos e isquiotibiales mientras mejora movilidad de cadera y tobillo.\n\nEs fundamental para aprender la técnica antes de añadir carga (barra, kettlebell) y puede hacerse en cualquier lugar.\n\nTambién sirve como calentamiento, ejercicio de rehabilitación o parte de circuitos de entrenamiento en casa.",
    "cues": "Pies a la anchura de hombros, dedos ligeramente hacia fuera.\nPecho alto, mirada al frente; brazos al frente o junto al cuerpo para equilibrio.\nBaja como si te sentaras en una silla invisible; las rodillas siguen la línea de los pies.\nBaja hasta que los muslos estén al menos paralelos al suelo.\nMantén el peso sobre los talones y la parte media del pie.",
    "commonMistakes": "Talones que se elevan: falta de dorsiflexión o movilidad de tobillo.\nRodillas que se meten hacia dentro (valgo): activa glúteos para empujar rodillas hacia fuera.\nInclinar el torso en exceso hacia adelante: trabaja movilidad de cadera.\nNo bajar lo suficiente: busca al menos paralelo para un trabajo completo.\nArquear o redondear la espalda: mantén la columna neutral.",
    "regressions": "Squat a una silla (tocar y levantar) para aprender el patrón.\nSquat asistido sujetándose a una barra o pared.\nSquat con un objeto entre las rodillas para activar aductores.",
    "progressions": "Squat con salto (jump squat) para potencia.\nPistol squat asistido (una pierna) con apoyo.\nSquat con pausa en la parte inferior.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/46/Squat.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "bodyweight-squat",
    "name": "Sentadilla (peso corporal)",
    "environment": "MIXED",
    "primaryMuscle": "Piernas y glúteos",
    "description": "La sentadilla con peso corporal es un patrón básico para piernas y cadera. El objetivo es bajar controlado manteniendo el tronco estable y subir empujando el suelo con todo el pie. Prioriza rango cómodo y técnica: si hay dolor agudo (rodilla/espalda/cadera), reduce rango o usa una regresión.",
    "cues": "• Coloca los pies a la anchura de hombros (ligeramente abiertos).\n• Reparte el peso en todo el pie (talón + base del dedo gordo + base del meñique).\n• Inicia el descenso llevando la cadera atrás y abajo, como sentarte.\n• Rodillas siguen la línea de los dedos (no colapsan hacia dentro).\n• Mantén el pecho \"orgulloso\" y el abdomen firme; espalda neutra.\n• Baja hasta donde puedas sin perder postura (muslos paralelos es una referencia, no obligación).\n• Sube empujando el suelo, exhala al pasar la parte difícil y aprieta glúteos arriba sin hiperextender la espalda.",
    "commonMistakes": "• Rodillas hacia dentro (valgo): reduce profundidad, abre ligeramente pies y piensa \"rodillas hacia fuera\".\n• Talones se levantan: acorta rango, prueba elevar talones con una cuña o trabaja movilidad de tobillo.\n• Redondear la espalda en el fondo: baja menos, controla el core, usa caja/silla.\n• Bajar \"a plomo\" sin cadera: piensa 'cadera atrás y abajo'.\n• Rebotar en el fondo: pausa breve y sube con control.",
    "regressions": "• Sentadilla a caja/silla (toca y sube).\n• TRX o apoyo en marco/mesa para descargar.\n• Sentadilla parcial (rango cómodo) con tempo 3s bajada.",
    "progressions": "• Sentadilla con pausa 2s abajo.\n• Tempo 3-1-1 (3s baja, 1s pausa, 1s sube).\n• Sentadilla búlgara (split squat) o sentadilla a una pierna asistida.",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=m0GcZ24pK6k",
        "thumbnailUrl": "https://img.youtube.com/vi/m0GcZ24pK6k/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://commons.wikimedia.org/wiki/Special:FilePath/Squats.gif",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "home-plank-22",
    "name": "Plank",
    "environment": "HOME",
    "primaryMuscle": "Core (transverso, recto abdominal, oblicuos)",
    "description": "El plank (plancha) es un ejercicio isométrico que mantiene el cuerpo en posición de flexión con los antebrazos apoyados.\n\nFortalece el core: transverso abdominal, recto abdominal y oblicuos, además de mejorar la estabilidad del tronco.\n\nNo requiere material y puede hacerse en cualquier sitio. Es la base para una buena postura y para proteger la espalda en otros ejercicios.\n\nLa variante con brazos extendidos (en posición de flexión) es ligeramente más exigente que la de antebrazos.",
    "cues": "Apoya antebrazos en el suelo, codos alineados bajo los hombros.\nMantén el cuerpo en una línea recta de cabeza a talones.\nMetiendo el ombligo hacia la columna (activar transverso).\nAprieta glúteos para evitar que la cadera se hunda.\nRespira con normalidad; no contengas la respiración.",
    "commonMistakes": "Cadera demasiado alta (forma de V): reduce el trabajo del core.\nCadera hundida (forma de U): sobrecarga lumbar.\nDejar caer la cabeza: alinea cuello con la columna.\nContener la respiración: respira de forma constante.\nEncoger los hombros hacia las orejas: mantén depresión escapular.",
    "regressions": "Plank con rodillas apoyadas (modificado).\nPlank en pared (vertical) o inclinado con manos en superficie elevada.\nMantener la posición 10-15 segundos y aumentar progresivamente.",
    "progressions": "Plank con elevación alterna de pierna.\nPlank lateral (side plank).\nPlank con apoyo en manos (posición de flexión) en lugar de antebrazos.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=mwlp75MS6Rg",
        "thumbnailUrl": "https://img.youtube.com/vi/mwlp75MS6Rg/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "forearm-plank",
    "name": "Plancha frontal (plank)",
    "environment": "MIXED",
    "primaryMuscle": "Core (abdomen) y estabilidad",
    "description": "La plancha frontal es un ejercicio de estabilidad: no va de aguantar por aguantar, sino de mantener una posición sólida sin colapsar la zona lumbar ni cargar el cuello.\n\nObjetivo: cuerpo en línea (cabeza–hombros–cadera–tobillos) con abdomen y glúteos activos. Si aparece dolor agudo (espalda/hombro/cuello), para y usa una regresión.",
    "cues": "• Colócate boca abajo y apoya antebrazos: codos debajo de hombros.\n• Empuja el suelo con antebrazos y separa ligeramente los hombros de las orejas.\n• Activa glúteos y abdomen: piensa 'costillas abajo' (sin sacar pecho).\n• Pelvis neutra: evita arquear la espalda o subir demasiado la cadera.\n• Piernas firmes: talones empujan hacia atrás; rodillas extendidas.\n• Cuello neutro: mirada al suelo, nuca larga.\n• Respira: exhala largo sin perder tensión (no aguantes el aire).\n\nSeñal de buena ejecución: puedes mantener la forma 10–30s sin temblores extremos ni dolor.",
    "commonMistakes": "• Cadera hundida / lumbar arqueada: reduce el tiempo, activa glúteos, acorta el rango usando rodillas.\n• Cadera muy alta: deja de trabajar el core. Baja un poco y vuelve a 'costillas abajo'.\n• Hombros encogidos: empuja el suelo, hombros lejos de orejas.\n• Cabeza adelantada: cuello neutro, mira al suelo.\n• Aguantar la respiración: usa respiración controlada.\n\nSEGURIDAD: si hay dolor agudo o hormigueo, detén. Ajusta a regresión (rodillas o plancha inclinada).",
    "regressions": "REGRESIONES (más fácil)\n• Plancha inclinada: antebrazos en mesa/banco (menos carga).\n• Plancha con rodillas: mantiene pelvis alineada, evita hundir la espalda.\n• Series cortas: 3–5 x 10–15s con descansos, priorizando forma perfecta.",
    "progressions": "PROGRESIONES (más difícil)\n• Aumenta tiempo manteniendo técnica (sin pasar de 60s si se degrada la forma).\n• Plancha con toque de hombro (solo si no rota la cadera).\n• Plancha con pies elevados (más demanda).\n• RKC plank (más tensión, menos tiempo): glúteos y abdomen muy activos 10–20s.",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=vX6xSyxdsRo",
        "thumbnailUrl": "https://img.youtube.com/vi/vX6xSyxdsRo/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://commons.wikimedia.org/wiki/Special:FilePath/Plank.jpg",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "side-plank",
    "name": "Plancha lateral (side plank)",
    "environment": "MIXED",
    "primaryMuscle": "Oblicuos / estabilidad de cadera",
    "description": "La plancha lateral entrena el \"lateral core\" (oblicuos) y la estabilidad de hombro y cadera. No es un ejercicio de aguante infinito: la prioridad es mantener una línea estable sin colapsar el hombro ni dejar caer la cadera.\n\nObjetivo: cuerpo alineado (hombros–cadera–tobillos) y cadera alta, con respiración controlada. Si aparece dolor agudo en hombro, cuello o zona lumbar, detén y usa una regresión.",
    "cues": "• Colócate de lado y apoya el antebrazo: codo justo debajo del hombro.\n• Antebrazo firme en el suelo; empuja el suelo para \"separar\" el hombro de la oreja.\n• Piernas estiradas y pies apilados (o uno delante del otro para más estabilidad).\n• Activa glúteos y abdomen: piensa 'costillas abajo' y pelvis neutra.\n• Eleva la cadera: tu cuerpo forma una línea recta de cabeza a pies.\n• Cuello neutro: mirada al frente o al suelo, sin encoger.\n• Respira: exhala lento sin perder tensión.\n\nDuración recomendada para calidad: 10–30s por lado. Mejor varias series cortas que una larga con mala forma.",
    "commonMistakes": "• Hombro colapsa / te 'cuelgas': empuja el suelo, codo bajo hombro, acorta la serie.\n• Cadera cae: baja el tiempo o usa rodillas; piensa 'cadera alta'.\n• Rotar el tronco hacia delante o atrás: mantén hombros apilados; pies en 'tijera' si hace falta.\n• Dolor en cuello: relaja trapecios, cuello neutro, no encoger.\n• Dolor en muñeca: usa antebrazo (esta versión) en lugar de mano.\n\nSEGURIDAD: si aparece dolor agudo o sensación rara, para. Ajusta con regresión (rodillas/inclinada).",
    "regressions": "REGRESIONES (más fácil)\n• Plancha lateral con rodillas apoyadas (bent-knee): rodillas dobladas, cadera alta.\n• Plancha lateral inclinada: antebrazo en banco/mesa.\n• Series muy cortas: 5–10s perfectos, repetir 3–5 veces por lado.",
    "progressions": "PROGRESIONES (más difícil)\n• Elevar la pierna superior (star plank) manteniendo pelvis estable.\n• Pausa + respiración: mantener 20–30s con respiración lenta sin perder forma.\n• Side plank con reach-through (rotación controlada) solo si no pierdes alineación.\n• Copenhagen plank (avanzado) — solo si ya dominas la base.",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=XeN4pEZZJNI",
        "thumbnailUrl": "https://img.youtube.com/vi/XeN4pEZZJNI/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://commons.wikimedia.org/wiki/Special:FilePath/Side%20Plank.jpg",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "home-lunges-23",
    "name": "Lunges",
    "environment": "HOME",
    "primaryMuscle": "Cuádriceps, glúteos, isquiotibiales",
    "description": "Zancada que trabaja piernas de forma unilateral y mejora equilibrio y estabilidad.",
    "cues": "Paso amplio hacia adelante.\nRodilla delantera alineada con el tobillo.\nBaja la rodilla trasera hacia el suelo.\nTronco erguido.",
    "commonMistakes": "Rodilla delantera que sobrepasa el pie.\nPaso demasiado corto.\nInclinar el torso hacia adelante.\nPerder el equilibrio.",
    "regressions": "Lunges asistido con apoyo, lunges estático.",
    "progressions": "Lunges caminando, lunges con salto.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=QOVaHwm-Q6U",
        "thumbnailUrl": "https://img.youtube.com/vi/QOVaHwm-Q6U/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "forward-lunge",
    "name": "Zancada (lunge)",
    "environment": "MIXED",
    "primaryMuscle": "Piernas y glúteos",
    "description": "La zancada es un patrón unilateral (una pierna cada vez) que mejora fuerza, estabilidad y control. El objetivo es bajar y subir con equilibrio, manteniendo rodilla y cadera alineadas.\n\nPrioridad: control y rango cómodo. Si aparece dolor agudo en rodilla/cadera/espalda, detén el ejercicio, reduce rango o usa una regresión.",
    "cues": "• Postura inicial: de pie, abdomen firme, pecho estable.\n• Da un paso hacia delante lo bastante largo para que al bajar la rodilla delantera no se vaya muy por delante del pie.\n• Baja en vertical: imagina que tu cadera cae \"entre\" ambas piernas (no hacia delante).\n• Rodilla delantera sigue la línea de los dedos (evita colapsar hacia dentro).\n• Tronco ligeramente inclinado si lo necesitas, pero sin redondear la espalda.\n• Apoya el peso en todo el pie delantero (talón + base dedo gordo + base meñique).\n• Rodilla trasera apunta al suelo; toca suave o se queda cerca.\n• Sube empujando el suelo con el pie delantero, manteniendo control y equilibrio.",
    "commonMistakes": "• Rodilla hacia dentro (valgo): reduce profundidad, baja más lento y piensa \"rodilla sigue a los dedos\".\n• Paso demasiado corto: la rodilla se desplaza en exceso; alarga el paso.\n• Rebotar abajo: pausa breve y sube con control.\n• Perder estabilidad (bamboleo): usa apoyo (pared/mesa) o haz zancada estática.\n• Dolor en rodilla: revisa paso, alineación y rango. Si persiste, cambia a regresión (split squat con apoyo o step-back lunge) y evita el dolor.\n\nSEGURIDAD: ante dolor agudo, mareo o sensación rara, para. No \"empujes a través del dolor\".",
    "regressions": "REGRESIONES (más fácil)\n• Zancada estática (split squat): pies fijos, sin paso.\n• Zancada con apoyo (mano en pared/mesa) para equilibrio.\n• Rango parcial: baja solo hasta mantener alineación perfecta.\n• Step-back lunge (paso atrás): suele ser más amable para rodilla en algunos casos.",
    "progressions": "PROGRESIONES (más difícil)\n• Pausa 2s abajo sin perder alineación.\n• Tempo 3-1-1 (3s bajada, 1s pausa, 1s subida).\n• Walking lunges (zancadas caminando).\n• Zancada con carga (mancuernas) cuando la técnica sea sólida.",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=2oI9XqmR3nk",
        "thumbnailUrl": "https://img.youtube.com/vi/2oI9XqmR3nk/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/a/af/Lunge-CDC_strength_training_for_older_adults.gif",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "home-glute-bridge-24",
    "name": "Glute Bridge",
    "environment": "HOME",
    "primaryMuscle": "Glúteos, isquiotibiales, core",
    "description": "Puente de glúteos para activar y fortalecer glúteos e isquiotibiales con control de la pelvis.",
    "cues": "Pies apoyados, rodillas a 90°.\nEmpuja con los talones.\nSqueeze glúteos en la parte alta.\nNo arquees la espalda en exceso.",
    "commonMistakes": "Usar más la espalda que los glúteos.\nNo contraer glúteos al subir.\nPies demasiado lejos o cerca.\nRebotar en el punto bajo.",
    "regressions": "Bridge con apoyo de brazos, bridge con banda.",
    "progressions": "Hip thrust en suelo, single-leg bridge.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Bridge_exercise.svg/440px-Bridge_exercise.svg.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=EEtd0uY-bMw",
        "thumbnailUrl": "https://img.youtube.com/vi/EEtd0uY-bMw/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "glute-bridge",
    "name": "Puente de glúteos (glute bridge)",
    "environment": "MIXED",
    "primaryMuscle": "Glúteos e isquios",
    "description": "El puente de glúteos fortalece glúteos y parte posterior del muslo con baja complejidad y suele ser una opción segura si se hace con control.\n\nObjetivo: elevar la cadera apretando glúteos, manteniendo las costillas \"cerradas\" y sin arquear la zona lumbar. Si notas dolor agudo en espalda o cadera, reduce rango o usa una regresión.",
    "cues": "• Túmbate boca arriba, rodillas flexionadas, pies apoyados a la anchura de caderas.\n• Acerca los talones al glúteo: al subir deberías notar trabajo en glúteo, no solo en lumbares.\n• Antes de subir: abdomen firme y costillas abajo (evita sacar pecho y arquear espalda).\n• Empuja el suelo con TODO el pie (especialmente talón) y eleva la cadera.\n• Arriba: línea hombros–cadera–rodillas (sin sobrepasar).\n• Aprieta glúteos 1–2s arriba, respiración controlada.\n• Baja lento y controlado, sin \"dejarte caer\".",
    "commonMistakes": "• Subir demasiado y arquear la espalda: baja el rango, piensa 'costillas abajo' y aprieta glúteos.\n• Notarlo solo en lumbares: acerca talones, reduce altura y prioriza apretar glúteos.\n• Rodillas se abren o se juntan: mantén rodillas alineadas con pies (imagina 'rail' estable).\n• Empujar con puntas en vez de talón: redistribuye el peso a talón y mediopié.\n• Repeticiones rápidas: usa tempo (2–3s subida, 2–3s bajada).\n\nSEGURIDAD: si aparece dolor agudo o sensación rara, para. Ajusta rango y técnica. Si persiste, evita el ejercicio.",
    "regressions": "REGRESIONES (más fácil)\n• Puente parcial: sube menos, mantén control.\n• Isométrico corto: mantener 5–10s a media altura.\n• Elevar la cadera con pausa corta arriba, pocas reps y estrictas.",
    "progressions": "PROGRESIONES (más difícil)\n• Puente con pausa 2–3s arriba.\n• Tempo 3-1-3 (3s sube, 1s pausa, 3s baja).\n• Puente a una pierna (single-leg) alternando: solo si controlas que la pelvis no rote.\n• Hip thrust con banco (más rango) cuando la técnica sea sólida.",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=wPM8icPu6H8",
        "thumbnailUrl": "https://img.youtube.com/vi/wPM8icPu6H8/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://commons.wikimedia.org/wiki/Special:FilePath/Glute-bridge.png",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "hip-thrust-barra",
    "name": "Hip thrust con barra",
    "environment": "GYM",
    "primaryMuscle": "Glúteos, isquiotibiales",
    "description": "Extensión de cadera con la parte alta de la espalda apoyada en un banco y una barra sobre la cadera. En gimnasio es una forma potente de progresar fuerza de glúteos con recorrido mayor que el puente en el suelo.\n\nTécnica: Escápulas apoyadas en el borde del banco, pies firmes al suelo. Barra sobre el pliegue de la cadera (usa acolchado). Mentón ligeramente recogido, costillas abajo. Empuja con talones y extiende cadera hasta que tronco quede en mesa, sin arquear lumbar. Baja controlado.",
    "cues": "Costillas abajo\nBarbilla ligeramente recogida\nEmpuja el suelo con talones\nArriba: glúteo fuerte, lumbar neutra",
    "commonMistakes": "Hiperextender lumbar arriba (en vez de glúteo): costillas abajo, no arquees.\nPies demasiado lejos o cerca (lo sientes en cuádriceps o lumbar): ajusta hasta sentir glúteo.\nRebotar en el fondo: control.\nNo usar acolchado y que moleste la barra.",
    "regressions": "Volver al puente de glúteos (ya en catálogo)\nHip thrust sin barra (peso corporal)\nMenos carga + pausa 1s arriba",
    "progressions": "Más carga manteniendo técnica\nPausa 2s arriba\nTempo: bajada 2–3s",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Barbell_hip_thrust.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=LM8XHLYJoYs",
        "thumbnailUrl": "https://img.youtube.com/vi/LM8XHLYJoYs/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-mountain-climber-25",
    "name": "Mountain Climber",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-burpee-26",
    "name": "Burpee",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-jumping-jack-27",
    "name": "Jumping Jack",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-squat-jump-28",
    "name": "Squat Jump",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-wall-sit-29",
    "name": "Wall Sit",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-crunches-30",
    "name": "Crunches",
    "environment": "HOME",
    "primaryMuscle": "Recto abdominal",
    "description": "Flexión del tronco en el suelo para trabajar los abdominales superiores.",
    "cues": "Pies apoyados, rodillas dobladas.\nManos detrás de la cabeza sin tirar.\nEleva hombros del suelo, no el cuello.\nExhala al subir.",
    "commonMistakes": "Tirar del cuello con las manos.\nSubir todo el tronco (debe ser curl).\nRebotar sin control.\nContener la respiración.",
    "regressions": "Crunch con piernas elevadas en silla.",
    "progressions": "Bicycle crunch, crunch con peso.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Crunch_exercise.svg/440px-Crunch_exercise.svg.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Xyd_fa5zoEU",
        "thumbnailUrl": "https://img.youtube.com/vi/Xyd_fa5zoEU/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-bicycle-crunch-31",
    "name": "Bicycle Crunch",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-superman-32",
    "name": "Superman",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-bird-dog-33",
    "name": "Bird Dog",
    "environment": "HOME",
    "primaryMuscle": "Core, espalda baja, glúteos",
    "description": "Ejercicio de estabilidad que combina extensión de brazo y pierna opuestos. Excelente para la espalda baja.",
    "cues": "Manos bajo hombros, rodillas bajo cadera.\nExtiende brazo y pierna opuestos.\nMantén la espalda neutral.\nMueve lento y controlado.",
    "commonMistakes": "Arquear la espalda baja.\nBalancear o usar momentum.\nLevantar demasiado alto.\nRotar la cadera.",
    "regressions": "Bird dog con apoyo de mano en pared.",
    "progressions": "Bird dog con pausa, bird dog con banda.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Birddog_exercise.svg/440px-Birddog_exercise.svg.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=wiFNA3sqjCA",
        "thumbnailUrl": "https://img.youtube.com/vi/wiFNA3sqjCA/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "bird-dog",
    "name": "Bird-dog (extensión alterna brazo/pierna)",
    "environment": "MIXED",
    "primaryMuscle": "Core (estabilidad lumbar) y control",
    "description": "Bird-dog es un ejercicio de estabilidad: enseña a mantener la columna neutra mientras mueves brazos y piernas. Es muy útil para proteger la zona lumbar y mejorar el control en patrones como sentadilla o bisagra (RDL).\n\nObjetivo: moverte sin que la pelvis rote ni la espalda se arquee. Si aparece dolor agudo en espalda, para y usa una regresión.",
    "cues": "• Posición inicial: a cuatro apoyos (manos bajo hombros, rodillas bajo caderas).\n• 'Costillas abajo' + abdomen firme: imagina que llevas un cinturón ajustado.\n• Espalda neutra: ni hundida ni redondeada.\n• Extiende a la vez: una pierna hacia atrás y el brazo contrario hacia delante.\n• Mantén la pelvis cuadrada al suelo (no gires la cadera).\n• Altura: pierna a nivel de cadera (no más alto si arqueas), brazo a la altura del hombro.\n• Pausa 1–2s al final manteniendo control.\n• Vuelve lento al centro sin colapsar.\n• Respira: exhala suave mientras estabilizas; no aguantes el aire.\n\nMeta: 6–10 repeticiones por lado con máxima calidad.",
    "commonMistakes": "• Girar la pelvis: reduce rango y mueve más lento; piensa 'caderas como faros apuntan al suelo'.\n• Arquear la zona lumbar: baja la pierna, activa abdomen y glúteo; no busques altura.\n• Encoger hombros: cuello largo, hombros lejos de orejas.\n• Repeticiones rápidas: pierde control. Solución: tempo lento y pausas.\n\nSEGURIDAD: si hay dolor agudo o irradiado, detén. Prioriza control y rango pequeño.",
    "regressions": "REGRESIONES (más fácil)\n• Solo piernas: extiende una pierna atrás manteniendo pelvis estable.\n• Solo brazos: extiende un brazo sin mover caderas.\n• Bird-dog con dedos: apoya puntas del pie extendido en el suelo para más estabilidad.\n• Pausas cortas: 3–5s isométricos con rango pequeño.",
    "progressions": "PROGRESIONES (más difícil)\n• Pausa 3–5s en cada repetición.\n• Deslizar mano/pie (slider) manteniendo control.\n• Bird-dog 'draw a box': micro movimientos sin rotar pelvis.\n• Añadir resistencia ligera (banda) solo si la técnica es perfecta.",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=wiFNA3sqjCA",
        "thumbnailUrl": "https://img.youtube.com/vi/wiFNA3sqjCA/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Bird_dog_exercise.gif",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "home-dead-bug-34",
    "name": "Dead Bug",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-hip-thrust-35",
    "name": "Hip Thrust",
    "environment": "HOME",
    "primaryMuscle": "Glúteos, isquiotibiales",
    "description": "Extensión de cadera con espalda apoyada. Muy efectivo para activar los glúteos.",
    "cues": "Parte superior de la espalda en banco o suelo.\nEmpuja con los talones.\nMáxima contracción de glúteos arriba.\nChin metido para proteger el cuello.",
    "commonMistakes": "Hiperextensión lumbar.\nNo alcanzar la extensión completa de cadera.\nUsar el cuello para empujar.\nRebotar.",
    "regressions": "Glute bridge, hip thrust sin peso.",
    "progressions": "Hip thrust con barra, single-leg hip thrust.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Bridge_exercise.svg/440px-Bridge_exercise.svg.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=EEtd0uY-bMw",
        "thumbnailUrl": "https://img.youtube.com/vi/EEtd0uY-bMw/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-step-up-36",
    "name": "Step-up",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "step-up",
    "name": "Step-up (subida a cajón/escalón)",
    "environment": "MIXED",
    "primaryMuscle": "Piernas y glúteos",
    "description": "El step-up es un patrón unilateral (una pierna a la vez) que fortalece piernas y glúteos con una carga muy controlable. Bien hecho, es una opción amable para rodilla porque permite ajustar altura y rango.\n\nObjetivo: subir al escalón usando la pierna de arriba, con rodilla alineada y control, sin impulsarte con la pierna de abajo.",
    "cues": "• Elige una altura que puedas controlar: empieza bajo (escalón) antes que alto.\n• Pie completo sobre el escalón: talón y punta apoyados.\n• Rodilla alineada con los dedos del pie (evita que se meta hacia dentro).\n• Inclina el torso ligeramente hacia delante si ayuda a cargar glúteo, sin redondear la espalda.\n• Empuja el escalón con el pie de arriba (piensa 'subo con esta pierna').\n• Sube hasta estar erguido arriba, cadera extendida, sin hiperextender la espalda.\n• Baja lento y controlado: primero cadera hacia atrás un poco, luego pie al suelo.\n• Mantén pelvis estable: evita girarte hacia el lado.\n\nRitmo recomendado: 2–3s subida, 2–3s bajada.",
    "commonMistakes": "• Impulsarte con la pierna de abajo: reduce altura y concéntrate en empujar con el pie de arriba.\n• Rodilla colapsa hacia dentro: baja la altura, reduce velocidad y piensa 'rodilla sigue a los dedos'.\n• Empujar solo con la punta (talón se despega): apoya todo el pie, presiona el talón.\n• Rebotar al bajar: controla la bajada, no te dejes caer.\n• Escalón demasiado alto: genera compensaciones. Empieza con altura más baja.\n\nSEGURIDAD: si aparece dolor agudo en rodilla/cadera/espalda, detén. Ajusta altura, rango y control. Evita trabajar con dolor.",
    "regressions": "REGRESIONES (más fácil)\n• Altura muy baja (libro/escalón pequeño).\n• Apoyo con mano en pared/barandilla para equilibrio.\n• Step-up parcial: subir y bajar sin llegar a extensión completa.\n• Repeticiones lentas con pausa arriba 1s para estabilidad.",
    "progressions": "PROGRESIONES (más difícil)\n• Aumentar altura gradualmente manteniendo alineación.\n• Pausa 2s arriba sin perder estabilidad.\n• Carga externa (mancuernas) cuando la técnica sea sólida.\n• Step-up con rodilla arriba (knee drive) solo si mantienes pelvis estable.",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=dQqApCGd5Ss",
        "thumbnailUrl": "https://img.youtube.com/vi/dQqApCGd5Ss/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Step-up_exercise.gif",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "home-inchworm-37",
    "name": "Inchworm",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-bear-crawl-38",
    "name": "Bear Crawl",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "home-high-knees-39",
    "name": "High Knees",
    "environment": "HOME",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=WDIpL0pjun0",
        "thumbnailUrl": "https://img.youtube.com/vi/WDIpL0pjun0/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-pull-up-40",
    "name": "Pull-up",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Dorsales, bíceps, core",
    "description": "El pull-up (dominada) es una tracción vertical colgado de una barra, ejercicio fundamental de calistenia.\n\nDesarrolla dorsales, bíceps y requiere un core estable para evitar balanceos.\n\nCon el agarre prono (palmas hacia fuera) se enfatiza más el dorsal; con agarre supino (chin-up) más el bíceps.\n\nEs un indicador de fuerza relativa del tren superior y base para progresiones como muscle-up o front lever.",
    "cues": "Agarre prono (palmas hacia fuera), algo más ancho que los hombros.\nCuelga con los brazos extendidos; inicia con depresión escapular (hombros hacia abajo).\nSube tirando con la espalda hasta que la barbilla supere la barra.\nBaja con control hasta extensión completa antes de la siguiente repetición.\nMantén el core activo para evitar balancear las piernas.",
    "commonMistakes": "Balanceo (kipping) cuando buscas fuerza estricta: pierde efectividad.\nNo alcanzar la extensión completa abajo: rango incompleto.\nEncoger los hombros al colgar: empieza con depresión escapular.\nTirar solo con los brazos: conduce el movimiento con los codos, siente el dorsal.\nDejar que la cabeza se vaya hacia atrás en exceso: mantén el cuello neutral.",
    "regressions": "Pull-up con banda de asistencia (sujeta a la barra).\nChin-up (agarre supino) suele ser más fácil.\nAustralian pull-up (barra baja, cuerpo inclinado) o remo invertido.",
    "progressions": "Pull-up con peso (cinturón, chaleco o mancuerna entre piernas).\nL-sit pull-up (piernas en L durante el movimiento).\nPull-up con pausa en la parte superior.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "inverted-row",
    "name": "Remo invertido (inverted row)",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Espalda (dorsal/romboides) y bíceps",
    "description": "El remo invertido es un tirón con peso corporal que fortalece espalda y bíceps sin necesidad de dominadas. Es ideal para equilibrar ejercicios de empuje (flexiones) y mejorar control escapular.\n\nObjetivo: tirar del pecho hacia la barra/agarre manteniendo el cuerpo firme (como una plancha) y los hombros estables. Prioriza control y rango cómodo.",
    "cues": "• Ajusta el material: barra a altura de cintura (o anillas/TRX). Cuanto más horizontal estés, más difícil.\n• Agarre: manos a la anchura de hombros (o algo más). Muñecas neutras.\n• Posición inicial: cuerpo en línea recta (cabeza–cadera–tobillos). Glúteos y abdomen activos.\n• Hombros: antes de tirar, 'mete los hombros en el bolsillo' (depresión escapular suave).\n• Tirón: lleva el pecho hacia la barra, no la barbilla. Codos cerca del cuerpo (aprox. 30–60°).\n• Pausa 1s arriba con escápulas controladas (sin encoger hombros).\n• Baja lento (2–3s) manteniendo el cuerpo alineado, sin dejar caer la cadera.",
    "commonMistakes": "• Cadera se hunde: pierde tensión y carga lumbar. Solución: aprieta glúteos/abdomen y reduce dificultad (más vertical).\n• Encoger hombros hacia orejas: carga cuello/hombro. Solución: depresión escapular antes de tirar.\n• Tirar con cuello/mentón: termina en 'pecho a la barra', cuello neutro.\n• Reps a tirones sin control: usa tempo y rango más fácil.\n\nSEGURIDAD: si hay dolor agudo en hombro/codo/muñeca, detén. Ajusta agarre, rango y ángulo. Evita forzar el final del recorrido si molesta el hombro.",
    "regressions": "REGRESIONES (más fácil)\n• Más vertical: eleva la barra o acorta el paso para que el cuerpo esté menos horizontal.\n• Rodillas flexionadas: pies más cerca y rodillas dobladas reduce carga.\n• Rango parcial: sube solo hasta donde mantengas hombros estables.",
    "progressions": "PROGRESIONES (más difícil)\n• Más horizontal: baja la barra o adelanta los pies.\n• Pausa arriba 2s sin encoger hombros.\n• Tempo 3-1-3 (3s sube, 1s pausa, 3s baja).\n• Pies elevados (muy difícil) manteniendo línea corporal.",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Fl0UMfdEzsE",
        "thumbnailUrl": "https://img.youtube.com/vi/Fl0UMfdEzsE/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://commons.wikimedia.org/wiki/Special:FilePath/Inverted%20row.jpg",
        "thumbnailUrl": null
      }
    ]
  },
  {
    "slug": "calisthenics-push-up-41",
    "name": "Push-up",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-dip-42",
    "name": "Dip",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Tríceps, pectorales, deltoides anterior",
    "description": "Los fondos en paralelas (dips) son un empuje vertical con peso corporal entre dos barras o paralelas.\n\nExcelentes para tríceps y pectorales; la inclinación del torso modula la implicación de cada grupo.\n\nTorso más erguido enfatiza tríceps; inclinación hacia adelante implica más el pecho.\n\nSon un ejercicio avanzado de calistenia y base para el muscle-up cuando se dominan las dominadas.",
    "cues": "Empieza con brazos extendidos, cuerpo estabilizado entre las barras.\nBaja flexionando codos y hombros hasta que los codos estén aproximadamente a 90°.\nMantén el torso erguido (más tríceps) o inclinación ligera hacia adelante (más pecho).\nNo dejes que los hombros se hundan excesivamente o roten hacia adelante.\nSube extendiendo los codos con control; evita bloquear de forma brusca.",
    "commonMistakes": "Bajar demasiado: puede forzar la articulación del hombro; para en 90° o antes si hay molestias.\nBalancear las piernas para impulsarse: reduce la efectividad.\nCodos que se abren mucho hacia fuera: mantén un ángulo moderado.\nNo bloquear o casi bloquear arriba: completa el rango de forma controlada.\nArquear la espalda en exceso: mantén el core activo.",
    "regressions": "Dips en banco (manos en banco, pies en suelo): menor carga.\nDips con banda de asistencia sujeta a las barras.\nDips en máquina asistida si está disponible.",
    "progressions": "Dips con peso (cinturón, chaleco).\nRing dips: mayor exigencia de estabilidad.\nL-sit dips: mantener piernas en L durante el movimiento.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=2z8JmcrW-As",
        "thumbnailUrl": "https://img.youtube.com/vi/2z8JmcrW-As/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "fondos-paralelas",
    "name": "Fondos en paralelas (dips)",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Pectorales, deltoides anterior, tríceps",
    "description": "Empuje en paralelas para trabajar pecho + tríceps con carga corporal. Muy útil como básico calistenia y como progresión natural de flexiones.\n\nTécnica: Arriba: brazos extendidos sin colgarte pasivo (hombros abajo, pecho estable). Baja controlado; codos hacia atrás/diagonal, sin abrirse exagerado. Profundidad: baja hasta donde el hombro siga sano (si hay pinchazo raro, recorta rango). Sube empujando fuerte sin balanceo. Mantén torso estable (sin kipping).",
    "cues": "Hombros lejos de orejas (arriba estable)\nBaja lento y controlado\nRango cómodo > rango forzado\nSube sólido sin balanceo",
    "commonMistakes": "Bajar demasiado profundo y forzar hombro: recorta rango.\nEncoger hombros arriba: pierdes estabilidad.\nRebotar abajo o balancear para subir: controla.\nCodos demasiado abiertos: más estrés articular.",
    "regressions": "Fondos asistidos (máquina o banda)\nNegativas (bajada 3–5s)\nRango parcial limpio (mejor corto y perfecto que largo y feo)",
    "progressions": "Pausa 1s abajo (solo si no molesta)\nMás repeticiones con forma estricta\nLastrados cuando ya son sólidos y sin dolor",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Dips.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=vi1-BOcj3cQ",
        "thumbnailUrl": "https://img.youtube.com/vi/vi1-BOcj3cQ/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-l-sit-43",
    "name": "L-Sit",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-handstand-44",
    "name": "Handstand",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-muscle-up-45",
    "name": "Muscle-up",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-pistol-squat-46",
    "name": "Pistol Squat",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-front-lever-47",
    "name": "Front Lever",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-planche-48",
    "name": "Planche",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-back-lever-49",
    "name": "Back Lever",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-hanging-leg-raise-50",
    "name": "Hanging Leg Raise",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-diamond-push-up-51",
    "name": "Diamond Push-up",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-archer-push-up-52",
    "name": "Archer Push-up",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-chin-up-53",
    "name": "Chin-up",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Bíceps, dorsales",
    "description": "Tracción vertical con agarre supino. Mayor énfasis en bíceps que el pull-up.",
    "cues": "Agarre supino, manos a la anchura de hombros.\nDeprime omóplatos al inicio.\nSube hasta que la barbilla supere la barra.\nSiente el trabajo en bíceps.",
    "commonMistakes": "Balanceo para ganar altura.\nEncoger hombros.\nNo llegar a extensión completa.\nCodos que se separan.",
    "regressions": "Chin-up con banda, australian chin-up.",
    "progressions": "Chin-up con peso, weighted chin-up.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=b-ztMQpj8yc",
        "thumbnailUrl": "https://img.youtube.com/vi/b-ztMQpj8yc/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-pike-push-up-54",
    "name": "Pike Push-up",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-hollow-hold-55",
    "name": "Hollow Hold",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-skin-the-cat-56",
    "name": "Skin the Cat",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-human-flag-57",
    "name": "Human Flag",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-front-roll-58",
    "name": "Front Roll",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "calisthenics-back-roll-59",
    "name": "Back Roll",
    "environment": "CALISTHENICS",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=9yVGh3XbJ34",
        "thumbnailUrl": "https://img.youtube.com/vi/9yVGh3XbJ34/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-freestyle-60",
    "name": "Freestyle",
    "environment": "POOL",
    "primaryMuscle": "Full body (dorsales, hombros, core, piernas)",
    "description": "Estilo libre o crol. El estilo de natación más rápido y eficiente.",
    "cues": "Cuerpo alargado y horizontal.\nRotación de hombros y cadera.\nRespiración lateral.\nPatada desde la cadera.",
    "commonMistakes": "Cabeza demasiado alta.\nCruzar la mano sobre la línea central.\nPatada desde la rodilla.\nFalta de rotación.",
    "regressions": "Patada con tabla, brazada con pull buoy.",
    "progressions": "Intervalos, técnica de catch.",
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-backstroke-61",
    "name": "Backstroke",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-breaststroke-62",
    "name": "Breaststroke",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-butterfly-63",
    "name": "Butterfly",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-kickboard-64",
    "name": "Kickboard",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-water-tread-65",
    "name": "Water Tread",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-pool-run-66",
    "name": "Pool Run",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-aqua-jog-67",
    "name": "Aqua Jog",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-sculling-68",
    "name": "Sculling",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-streamline-69",
    "name": "Streamline",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-flip-turn-70",
    "name": "Flip Turn",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-open-turn-71",
    "name": "Open Turn",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-side-stroke-72",
    "name": "Side Stroke",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-elementary-back-73",
    "name": "Elementary Back",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-water-polo-drill-74",
    "name": "Water Polo Drill",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-lap-swim-75",
    "name": "Lap Swim",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-sprint-76",
    "name": "Sprint",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-drill-set-77",
    "name": "Drill Set",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-cool-down-78",
    "name": "Cool Down",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "pool-warm-up-swim-79",
    "name": "Warm Up Swim",
    "environment": "POOL",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=5HLW2AI1Ink",
        "thumbnailUrl": "https://img.youtube.com/vi/5HLW2AI1Ink/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-circuit-a-80",
    "name": "Circuit A",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-circuit-b-81",
    "name": "Circuit B",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-hiit-block-82",
    "name": "HIIT Block",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-tabata-83",
    "name": "Tabata",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-amrap-84",
    "name": "AMRAP",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-emom-85",
    "name": "EMOM",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-chipper-86",
    "name": "Chipper",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-metcon-87",
    "name": "Metcon",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-wod-88",
    "name": "WOD",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-finisher-89",
    "name": "Finisher",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-warm-up-set-90",
    "name": "Warm-up Set",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-cool-down-set-91",
    "name": "Cool-down Set",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-mobility-block-92",
    "name": "Mobility Block",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-stretch-sequence-93",
    "name": "Stretch Sequence",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-recovery-run-94",
    "name": "Recovery Run",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-cross-train-95",
    "name": "Cross Train",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-combo-session-96",
    "name": "Combo Session",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-hybrid-97",
    "name": "Hybrid",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-fusion-workout-98",
    "name": "Fusion Workout",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "mixed-mixed-block-99",
    "name": "Mixed Block",
    "environment": "MIXED",
    "primaryMuscle": "Full body",
    "description": null,
    "cues": "Form first.",
    "commonMistakes": "Rushing.",
    "regressions": null,
    "progressions": null,
    "media": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Exercise.png",
        "thumbnailUrl": null
      },
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=Dy28eq2PjcM",
        "thumbnailUrl": "https://img.youtube.com/vi/Dy28eq2PjcM/hqdefault.jpg"
      }
    ]
  },
  {
    "slug": "paseo-del-granjero",
    "name": "Paseo del granjero (Farmer carry)",
    "environment": "MIXED",
    "primaryMuscle": "Agarre, core, espalda alta",
    "description": "Camina llevando dos mancuernas o kettlebells a los lados con el cuerpo alto y estable. Objetivo: agarre fuerte, core firme y hombros/espalda alta estables sin movimientos complejos.\n\nColócate de pie con el peso a los lados, costillas \"abajo\" y abdomen firme. Camina con pasos cortos y controlados, sin balancear el peso. Termina cuando puedas mantener la misma postura; si pierdes la técnica, reduce peso o distancia.",
    "cues": "Crece alto: corona hacia arriba\nCostillas abajo y abdomen firme\nHombros lejos de las orejas (no encoger)\nPasos cortos y controlados\nPeso pegado al cuerpo, sin balanceo",
    "commonMistakes": "Encoger hombros y tensar el cuello\nArquear la zona lumbar para \"sacar pecho\"\nCaminar con zancadas largas o con prisa\nElegir demasiado peso y torcer la postura\nBalancear las mancuernas al caminar",
    "regressions": "Menos peso manteniendo postura perfecta\nMenos distancia/tiempo (10–20 m o 15–30 s)\nSostén estático de pie (15–30 s) antes de caminar",
    "progressions": "Más distancia/tiempo sin perder técnica\nMás peso solo si no cambia la postura\nCaminar más lento para aumentar el control",
    "media": [
      {
        "type": "youtube",
        "url": "https://www.youtube.com/watch?v=p5MNNosenJc",
        "thumbnailUrl": "https://img.youtube.com/vi/p5MNNosenJc/hqdefault.jpg"
      },
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/5/56/USMC-111018-M-FY706-002.jpg",
        "thumbnailUrl": null
      }
    ]
  }
]
